[
  {
    "url": "https://gxigroup.com",
    "content": "Specialising in Fast-track End-to-end Office Fit Out and Refurbishments for Small & Medium Size Businesses We are a team of passionate people who specialise in end-to-end office office fit out and refurbishment for over 20 years. Our design & fit out approach is refreshingly transparent,truly personal and caringly responsible, and we have a lot of fun too. We genuinely love and really care about what we do which makes working with us an exciting and stress-free experience. When we say end to end solutions, we mean it. We work with you from the outset. Right from securing office premises through to building regulations, fire safety, renovation, refurbishment, fit out and furniture. What makes us different is our passionate enthusiasm for every project, be it small offices to an entire building of serviced offices. GXI have proudly completed hundreds of office and commercial space fit out and refurbishment projects in London, Bristol, Southampton, Birmingham, Manchester, Aberdeen, Middlesex, Elstree, Milton Keynes, Leicester, Croydon, Gatwick, Harrow, Slough, Stevenage, Leeds, Wokingham, Watford, Borehamwood, Reading, High Wycombe, Kent. We have helped fit out, renovate, refurbish offices and commercial workspaces for several clients from diverse industries, right from banks, recruitment companies and accountants, through to cafes, hotels, solicitors & law firms, housing associations, educational institutions, investors and many more. The type of Office Refurbishment and Fit Out projects we have handled are small, medium and large offices, warehouses, universities,hotels, spas, entire block of serviced offices and more. Our strength is our Interior Designers and team of experts who have extensive experience in creating gorgeous offices & workspaces with highest service. They combine design, commercial, and technical knowledge to provide the best experience, all at an affordable cost to fit out office space. Overall, office fit out cost  depends on a wide range of factors like the size of office space, facilities created, materials used, furniture sourced, and many more. Based on all these factors, the prices for office fit out and refurbishment may vary for different projects, however, this will give you a rough idea of ballpark office fit-out costs per square foot before starting your project. If you’ve got a new office space as shell and core and need to do CAT A and CAT B, here’s a list of cost you should be looking at: While CAT A fit out focuses on the basics of office build including floor work, ceiling works, basic mechanical and electrical services, CAT B fit-out is the next step that completes the designing process. Here is the list of CAT A + CAT B fit-out costs: CAT B only focuses on transforming the CAT A structure and giving it the final look. It includes works related to partition, finishes, design, furniture, etc.  Here is the list of pricing for CAT B only: These are typical figures based on past projects. However, office fit-out costs per square foot  may vary based on several factors. The final price will be fixed based on many factors like base structure and HVAC requirements of your office building. Devonshire House 582 Honeypot Lane Stanmore, Harrow London, HA7 1JS London Office: GXI Group 2-7 Clerkenwell Green London EC1R 0DE Company number: 03274123 -   -   Registered company name: GXI LTD | Company reg. no: 03274123           × * * * * * When we say end to end solutions, we mean it. We work with you from the outset. Right from securing office premises through to building regulations, fire safety, renovation, refurbishment, fit out and furniture. What makes us different is our passionate enthusiasm for every project, be it small offices to an entire building of serviced offices. GXI have proudly completed hundreds of office and commercial space fit out and refurbishment projects in London, Bristol, Southampton, Birmingham, Manchester, Aberdeen, Middlesex, Elstree, Milton Keynes, Leicester, Croydon, Gatwick, Harrow, Slough, Stevenage, Leeds, Wokingham, Watford, Borehamwood, Reading, High Wycombe, Kent. We have helped fit out, renovate, refurbish offices and commercial workspaces for several clients from diverse industries, right from banks, recruitment companies and accountants, through to cafes, hotels, solicitors & law firms, housing associations, educational institutions, investors and many more. The type of Office Refurbishment and Fit Out projects we have handled are small, medium and large offices, warehouses, universities,hotels, spas, entire block of serviced offices and more. Our strength is our Interior Designers and team of experts who have extensive experience in creating gorgeous offices & workspaces with highest service. They combine design, commercial, and technical knowledge to provide the best experience, all at an affordable cost to fit out office space. Overall, office fit out cost  depends on a wide range of factors like the size of office space, facilities created, materials used, furniture sourced, and many more. Based on all these factors, the prices for office fit out and refurbishment may vary for different projects, however, this will give you a rough idea of ballpark office fit-out costs per square foot before starting your project. x This site uses cookies. Office Design Office Fit Out Office Refurbishment Office Furniture Office Experts Office Design Office Fit Out Office Refurbishment Office Furniture Office Experts What We Do Our Projects Who We Are GXI Group provide end–to–end office fit out, refurbishment & furniture solutions When we say end to end solutions, we mean it. We work with you from the outset. Right from securing office premises through to building regulations, fire safety, renovation, refurbishment, fit out and furniture. What makes us different is our passionate enthusiasm for every project, be it small offices to an entire building of serviced offices. GXI have proudly completed hundreds of office and commercial space fit out and refurbishment projects in London, Bristol, Southampton, Birmingham, Manchester, Aberdeen, Middlesex, Elstree, Milton Keynes, Leicester, Croydon, Gatwick, Harrow, Slough, Stevenage, Leeds, Wokingham, Watford, Borehamwood, Reading, High Wycombe, Kent. We have helped fit out, renovate, refurbish offices and commercial workspaces for several clients from diverse industries, right from banks, recruitment companies and accountants, through to cafes, hotels, solicitors & law firms, housing associations, educational institutions, investors and many more. The type of Office Refurbishment and Fit Out projects we have handled are small, medium and large offices, warehouses, universities,hotels, spas, entire block of serviced offices and more. How much does Office fit out cost in London, UK? Our strength is our Interior Designers and team of experts who have extensive experience in creating gorgeous offices & workspaces with highest service. They combine design, commercial, and technical knowledge to provide the best experience, all at an affordable cost to fit out office space. Overall, office fit out cost  depends on a wide range of factors like the size of office space, facilities created, materials used, furniture sourced, and many more. Based on all these factors, the prices for office fit out and refurbishment may vary for different projects, however, this will give you a rough idea of ballpark office fit-out costs per square foot before starting your project. If you’ve got a new office space as shell and core and need to do CAT A and CAT B, here’s a list of cost you should be looking at: 1) CAT A + CAT B While CAT A fit out focuses on the basics of office build including floor work, ceiling works, basic mechanical and electrical services, CAT B fit-out is the next step that completes the designing process. Here is the list of CAT A + CAT B fit-out costs: Cost Factors Cost Construction £20 - £60+ Mechanical £25 - £35+ Electrical Network Infrastructure Furniture £6 - £16+ 2)CAT B only CAT B only focuses on transforming the CAT A structure and giving it the final look. It includes works related to partition, finishes, design, furniture, etc. Here is the list of pricing for CAT B only: £12 - £25+ £6 - £10+ These are typical figures based on past projects. However, office fit-out costs per square foot  may vary based on several factors. The final price will be fixed based on many factors like base structure and HVAC requirements of your office building. Our Work Company Our Services Contact Us - Registered company name: GXI LTD | Company reg. no: 03274123 × Request a call back from the GXI team First Name* Company* Last Name* Phone* Work Email* Preferred time Loading Your message has been sent. Thank you! Send Loading  Your message has been sent. Thank you!     Send"
  },
  {
    "url": "https://gxigroup.com/cdn-cgi/l/email-protection",
    "content": "The website from which you got to this page is protected by Cloudflare. Email addresses on that page have been hidden in order to keep them from being accessed by malicious bots. You must enable Javascript in your browser in order to decode the e-mail address. If you have a website and are interested in protecting it in a similar way, you can . Cloudflare Ray ID: 823502836866b285 • Your IP: Click to reveal 102.215.117.93 Performance & security by You are unable to access this email address Cloudflare Ray ID: 823502836866b285 • 102.215.117.93 • Performance & security by  Performance & security by Please enable cookies. Email Protection You are unable to access this email address gxigroup.com The website from which you got to this page is protected by Cloudflare. Email addresses on that page have been hidden in order to keep them from being accessed by malicious bots. You must enable Javascript in your browser in order to decode the e-mail address. If you have a website and are interested in protecting it in a similar way, you can ."
  },
  {
    "url": "https://gxigroup.com/what-we-do/",
    "content": "Specialising in Fast-track End-to-end Office Fit Out and Refurbishments for Small & Medium Size Businesses The right use of office space has a great impact on your business and your staff. Office spaces that have been properly planned and designed with your business in mind encourages intelligent and efficient working and boosts performance. We provide fully integrated office refurbishment service, right from planning & desigining, to build, furniture and aftercare. When fitting office partitions, these are some of the key aspects that we consider: Providing you with ongoing maintenance to ensure your network stays up and running Space, no matter how big or small, needs smart interiors which positively reflect you and your business and create an environment of positivity and confidence Helping you understand how to use your current space to assess how it can be optimised for the future to support your ways of working Devonshire House 582 Honeypot Lane Stanmore, Harrow London, HA7 1JS London Office: GXI Group 2-7 Clerkenwell Green London EC1R 0DE Company number: 03274123 -   -   Registered company name: GXI LTD | Company reg. no: 03274123         × * * * * * Existing framework of the premise How to plan the space effectively Style, comfort and flexible working Utilising natural light x This site uses cookies. What We Do | Office Space Planning & Design in London and the UK Space planning is a science as much as it is an art Modern Office Refurbishment & Fit Out \"Business is open as usual\" Office partitions with doors - Glass, Solid & Fire Partitions We have vast experience in workplace refurbishment and installing partitions Existing framework of the premise How to plan the space effectively Style, comfort and flexible working Utilising natural light Office IT Infrastructure Done by the book Office & Commercial Space Furniture Dream away… Workplace Consultancy & Wellbeing Key to a productive workplace Our Work Company Our Services Contact Us - Registered company name: GXI LTD | Company reg. no: 03274123 × Request a call back from the GXI team First Name* Company* Last Name* Phone* Work Email* Preferred time Loading Your message has been sent. Thank you! Send Loading  Your message has been sent. Thank you!     Send"
  },
  {
    "url": "https://gxigroup.com/blog/essential-information-for-an-office-move",
    "content": "Specialising in Fast-track End-to-end Office Fit Out and Refurbishments for Small & Medium Size Businesses , it can also be a smooth and successful transition for your business. In this guide, we will cover essential tips for planning an office move, including creating a detailed plan, selecting the right moving company, preparing your office space, managing the move itself, and settling into the new space. By following these tips, businesses can ensure that their office move is as efficient and stress-free as possible. The first step in planning an office move is to create a detailed plan. This should include a timeline, a budget, and a list of tasks that need to be completed. The plan should also include a detailed inventory of all the office equipment and furniture, so that nothing gets left behind or lost in the move. Additionally, it’s important to notify all employees, suppliers, customers, and stakeholders of the move, so that everyone is on the same page and can plan accordingly. Choosing the right moving company is crucial when planning an office move. When selecting a moving company, businesses should consider the company’s reputation, experience, and the level of service they provide. It’s also a good idea to get multiple quotes and compare prices, so that you can make an informed decision. Additionally, businesses should also ask the moving company about their insurance coverage and ask to see copies of their certifications. Once the moving company has been chosen, it’s time to start. This includes packing up all the , so that it’s ready to be moved. It’s also a good idea to label all the boxes with the contents and the room they need to go to, so that the moving process is as smooth as possible. Additionally, businesses should also arrange for the disconnection of all services, such as internet, phone, and electricity, so that they can be reconnected at the new location. Devonshire House 582 Honeypot Lane Stanmore, Harrow London, HA7 1JS London Office: GXI Group 2-7 Clerkenwell Green London EC1R 0DE Company number: 03274123 -   -   Registered company name: GXI LTD | Company reg. no: 03274123    by by  by  by  by       × * * * * * x This site uses cookies. ESSENTIAL INFORMATION FOR AN OFFICE MOVE Introduction:, it can also be a smooth and successful transition for your business. In this guide, we will cover essential tips for planning an office move, including creating a detailed plan, selecting the right moving company, preparing your office space, managing the move itself, and settling into the new space. By following these tips, businesses can ensure that their office move is as efficient and stress-free as possible.1. Creating a detailed plan:The first step in planning an office move is to create a detailed plan. This should include a timeline, a budget, and a list of tasks that need to be completed. The plan should also include a detailed inventory of all the office equipment and furniture, so that nothing gets left behind or lost in the move. Additionally, it’s important to notify all employees, suppliers, customers, and stakeholders of the move, so that everyone is on the same page and can plan accordingly.2. Choosing the right moving company:Choosing the right moving company is crucial when planning an office move. When selecting a moving company, businesses should consider the company’s reputation, experience, and the level of service they provide. It’s also a good idea to get multiple quotes and compare prices, so that you can make an informed decision. Additionally, businesses should also ask the moving company about their insurance coverage and ask to see copies of their certifications.3. Preparing the office space:Once the moving company has been chosen, it’s time to start. This includes packing up all the , so that it’s ready to be moved. It’s also a good idea to label all the boxes with the contents and the room they need to go to, so that the moving process is as smooth as possible. Additionally, businesses should also arrange for the disconnection of all services, such as internet, phone, and electricity, so that they can be reconnected at the new location. by / Related Posts Our Work Company Our Services Contact Us - Registered company name: GXI LTD | Company reg. no: 03274123 × Request a call back from the GXI team First Name* Company* Last Name* Phone* Work Email* Preferred time Loading Your message has been sent. Thank you! Send Loading  Your message has been sent. Thank you!     Send"
  },
  {
    "url": "https://gxigroup.com/terms-conditions/",
    "content": "Specialising in Fast-track End-to-end Office Fit Out and Refurbishments for Small & Medium Size Businesses 9. OUR DETAILS Devonshire House 582 Honeypot Lane Stanmore, Harrow London, HA7 1JS London Office: GXI Group 2-7 Clerkenwell Green London EC1R 0DE Company number: 03274123 -   -   Registered company name: GXI LTD | Company reg. no: 03274123         × * * * * * x This site uses cookies. Terms & Conditions GXI T&C’s These terms and conditions govern use of GXI Group website. Detail terms can be provided and request. Please read the terms in full before you use this Website. If you do not accept these terms, please do not use this Website. Using the Website implies that you accept these terms. We do occasionally update these terms so please refer back to them in the future. 1. SITE ACCESS You will be able to access the majority of this Website without having to register any details with us. However, certain areas of this Website will only be accessible only if you have registered with us. 2. USE OF WEBSITE You are NOT permitted to use our website for the purposes to print and download material from this Website without written consent from GXI Group. You cannot also modify any content without our consent. Material on this website must not be republished online or offline without our permission. The copyright and other intellectual property rights in all material on this Website are owned by us or our licensors and must not be reproduced without our prior consent. 3. SITE UPTIME We take all reasonable steps to ensure that this Website is available 24 hours every day, 365 days per year. However, websites do sometimes encounter downtime due to server and, other technical issues. Therefore we will not be liable if this website is unavailable at any time. This Website may be temporarily unavailable due to issues such as system failure, maintenance or repair or for reasons beyond our control. Where possible we will try to give our visitors advance warning of maintenance issues but shall not be obliged to do so. 4. VISITOR CONDUCT With the exception of personally identifiable information, the use of which is covered under our Privacy Policy any material you send or post to this Website shall be considered non-proprietary and not confidential. Unless you advise to the contrary we will be free to copy, disclose, distribute, incorporate and otherwise use such material for any and all purposes. When using this website you shall not post or send to or from this Website any material: (a) for which you have not obtained all necessary consents; (b) that is discriminatory, obscene, pornographic, defamatory, liable to incite racial hatred, in breach of confidentiality or privacy, which may cause annoyance or inconvenience to others, which encourages or constitutes conduct that would be deemed a criminal offence, give rise to a civil liability, or otherwise is contrary to the law in the United Kingdom; (c) which is harmful in nature including, and without limitation, computer viruses, Trojan horses, corrupted data, or other potentially harmful software or data. We will fully co-operate with any law enforcement authorities or court order requiring us to disclose the identity or other details of any person posting material to this website in breach of our terms 5. LINKS TO AND FROM OTHER WEBSITES Any links to third party websites located on this Website are provided for your convenience only. We have not reviewed each third party website and have no responsibility for such third party websites or their content. We do not endorse the third party websites or make representations about them or any material contained in them. If you choose to access a third party website linked to from this Website, it is at your own risk. If you would like to link to this Website, you may only do so on the basis that you link to, but do not replicate, any page on this Website, and subject to the following conditions: – you do not in any way imply that we are endorsing any services or products unless this has been specifically agreed with us; – you do not misrepresent your relationship with us or present any false information about us; – you do not link from a website that is not owned by you; and – your website does not contain content that is offensive, controversial, infringes any intellectual property rights or other rights of any other person or does not comply in any way with the law in the United Kingdom. If you choose to link to our website in breach of our terms you shall fully indemnify us for any loss or damage suffered as a result of your actions. 6. DISCLAIMER We take all reasonable steps to ensure that the information on this Website is correct. However, we do not guarantee the correctness or completeness of material on this Website. We may make changes to the material on this Website at any time and without notice. The material on this Website may be out of date, or on rare occasions incorrect and we make no commitment to ensure that such material is correct or up to date. The material at this Website is provided without any conditions or warranties of any kind. To the maximum extent permitted by law, we provide access and use of this website on the basis that we exclude all representations, warranties and conditions which but for these Terms may have effect in relation to this Website. All trademarks are property of their respective trademark owners. We acknowledge associated owners of images and contents. However, we take reasonable steps to acknowledge all imagery and content but due to the volume of images and content there are occasion when such acknowledgement may get missed, on such occasion we request owners to contact us so we can either make appropriate acknowledgements or remove from our web site. GXI cannot be held liable or responsible for such image or content being displayed or any kind of loss or damage that may result to you or a third party as a result of the use on our website. 7. EXCLUSION OF LIABILITY Neither we nor any other party (whether or not involved in producing, maintaining or delivering this Website), shall be liability or responsible for any kind of loss or damage that may result to you or a third party as a result of your or their use of our website. This exclusion shall include servicing or repair costs and, without limitation, any other direct, indirect or consequential loss, and whether in tort or contract or otherwise in connection with this Website. Nothing in these Terms shall exclude or limit liability for (i) death or personal injury caused by negligence (as defined by the Unfair Contract Terms Act 1977); (ii) fraud; (iii) misrepresentation as to a fundamental matter; or (iv) any liability which cannot be excluded or limited under the law of the United Kingdom. 8. GOVERNING JURISDICTION This Legal Notice shall be governed by and construed in accordance with English law. Any dispute(s) arising in connection with this Legal Notice are subject to the exclusive jurisdiction of England and Wales. GXI Ltd Devonshire House, 582 Honeypot Lane, Stanmore, Middlesex, HA7 1JS GXI Ltd reg No. 3274123. Tel: Email: GXI T&C’s These terms and conditions govern use of GXI Group website. Detail terms can be provided and request. Please read the terms in full before you use this Website. If you do not accept these terms, please do not use this Website. Using the Website implies that you accept these terms. We do occasionally update these terms so please refer back to them in the future. 1. SITE ACCESS You will be able to access the majority of this Website without having to register any details with us. However, certain areas of this Website will only be accessible only if you have registered with us. 2. USE OF WEBSITE You are NOT permitted to use our website for the purposes to print and download material from this Website without written consent from GXI Group. You cannot also modify any content without our consent. Material on this website must not be republished online or offline without our permission. The copyright and other intellectual property rights in all material on this Website are owned by us or our licensors and must not be reproduced without our prior consent. 3. SITE UPTIME We take all reasonable steps to ensure that this Website is available 24 hours every day, 365 days per year. However, websites do sometimes encounter downtime due to server and, other technical issues. Therefore we will not be liable if this website is unavailable at any time. This Website may be temporarily unavailable due to issues such as system failure, maintenance or repair or for reasons beyond our control. Where possible we will try to give our visitors advance warning of maintenance issues but shall not be obliged to do so. 4. VISITOR CONDUCT With the exception of personally identifiable information, the use of which is covered under our Privacy Policy any material you send or post to this Website shall be considered non-proprietary and not confidential. Unless you advise to the contrary we will be free to copy, disclose, distribute, incorporate and otherwise use such material for any and all purposes. When using this website you shall not post or send to or from this Website any material: (a) for which you have not obtained all necessary consents; (c) which is harmful in nature including, and without limitation, computer viruses, Trojan horses, corrupted data, or other potentially harmful software or data. We will fully co-operate with any law enforcement authorities or court order requiring us to disclose the identity or other details of any person posting material to this website in breach of our terms 5. LINKS TO AND FROM OTHER WEBSITES Any links to third party websites located on this Website are provided for your convenience only. We have not reviewed each third party website and have no responsibility for such third party websites or their content. We do not endorse the third party websites or make representations about them or any material contained in them. If you choose to access a third party website linked to from this Website, it is at your own risk. If you would like to link to this Website, you may only do so on the basis that you link to, but do not replicate, any page on this Website, and subject to the following conditions: – you do not in any way imply that we are endorsing any services or products unless this has been specifically agreed with us; – your website does not contain content that is offensive, controversial, infringes any intellectual property rights or other rights of any other person or does not comply in any way with the law in the United Kingdom. If you choose to link to our website in breach of our terms you shall fully indemnify us for any loss or damage suffered as a result of your actions. 6. DISCLAIMER We take all reasonable steps to ensure that the information on this Website is correct. However, we do not guarantee the correctness or completeness of material on this Website. We may make changes to the material on this Website at any time and without notice. The material on this Website may be out of date, or on rare occasions incorrect and we make no commitment to ensure that such material is correct or up to date. The material at this Website is provided without any conditions or warranties of any kind. To the maximum extent permitted by law, we provide access and use of this website on the basis that we exclude all representations, warranties and conditions which but for these Terms may have effect in relation to this Website. All trademarks are property of their respective trademark owners. We acknowledge associated owners of images and contents. However, we take reasonable steps to acknowledge all imagery and content but due to the volume of images and content there are occasion when such acknowledgement may get missed, on such occasion we request owners to contact us so we can either make appropriate acknowledgements or remove from our web site. GXI cannot be held liable or responsible for such image or content being displayed or any kind of loss or damage that may result to you or a third party as a result of the use on our website. 7. EXCLUSION OF LIABILITY Neither we nor any other party (whether or not involved in producing, maintaining or delivering this Website), shall be liability or responsible for any kind of loss or damage that may result to you or a third party as a result of your or their use of our website. This exclusion shall include servicing or repair costs and, without limitation, any other direct, indirect or consequential loss, and whether in tort or contract or otherwise in connection with this Website. Nothing in these Terms shall exclude or limit liability for (i) death or personal injury caused by negligence (as defined by the Unfair Contract Terms Act 1977); (ii) fraud; (iii) misrepresentation as to a fundamental matter; or (iv) any liability which cannot be excluded or limited under the law of the United Kingdom. 8. GOVERNING JURISDICTION This Legal Notice shall be governed by and construed in accordance with English law. Any dispute(s) arising in connection with this Legal Notice are subject to the exclusive jurisdiction of England and Wales. Devonshire House, 582 Honeypot Lane, Stanmore, Middlesex, HA7 1JS GXI Ltd reg No. 3274123. Email:  Our Work Company Our Services Contact Us - Registered company name: GXI LTD | Company reg. no: 03274123 × Request a call back from the GXI team First Name* Company* Last Name* Phone* Work Email* Preferred time Loading Your message has been sent. Thank you! Send Loading  Your message has been sent. Thank you!     Send"
  }
]