[
  {
    "url": "https://nobacz.com/",
    "content": "NoBACZ is a Wound Care Company specialising in sustainable, rapid-setting flexible barrier dressings. Our products are developed using a patented natural polymer that sets rapidly on contact with wounds to provide a waterproof barrier keeping environmental pathogens and contaminants out and facilitating skin repair. Precision Liquid Bandages (also termed barrier dressings) were invented by Drs Jonathan Powell, Nuno Faria, Carlos Bastos and Will Thom at the University of Cambridge. The IP was filed by the University and a first scientific publication followed entitled ‘Robust rapid‑setting antibacterial liquid bandages’(1). The value of the technology was demonstrated in a proof-of-concept trial on dairy cows with the disease, digital dermatitis. This approach could address the significant impact this disease has on economic productivity in dairy farming and quality of life of the animals. In November 2020, NoBACZ Healthcare was established and product development began in earnest. After a robust period of proof of concept efficacy trial and development of tolerance and safety data. The first products were manufactured and launched in the UK at BCVA Congress in October 2023. NoBACZ’s Precision Liquid Bandages will change the way that we care for animals and, ultimately, humans. Our products are innovative and adaptable. They set on application and are resistant to bacterial colonisation but are antibiotic free. The products prevent microbial ingress or biofilm formation on their surfaces, but do not leach or treat the wound. They are water resistant and do not require removing as they remove themselves over time. And they are composed of only sustainable and safe components that are all food or feed grade in an alcohol base. They can be used over pre-applied antiseptic, or over pre-applied veterinary medicinal products such as topical sprays. Precision Liquid Bandages thrive in extreme environments, from the demands of the modern dairy farm through to all-weather outdoor pursuits, every bit as much as they do in a clean hospital or home environment. Want to keep up to date with our latest news, publications and product information? About Us Our Technology One Health Contact Us Report A Product Issue Privacy Policy Cookie Policy FAQs ©2023 by NoBACZ Healthcare.Website Design By       antibacterial     ©2023 by NoBACZ Healthcare.Website Design By VISIT CATTLE VISIT SHEEP VISIT EQUINE Our Technology NoBACZ is a Wound Care Company specialising in sustainable, rapid-setting flexible barrier dressings. Our products are developed using a patented natural polymer that sets rapidly on contact with wounds to provide a waterproof barrier keeping environmental pathogens and contaminants out and facilitating skin repair. Our Story Precision Liquid Bandages (also termed barrier dressings) were invented by Drs Jonathan Powell, Nuno Faria, Carlos Bastos and Will Thom at the University of Cambridge. The IP was filed by the University and a first scientific publication followed entitled ‘Robust rapid‑setting antibacterial liquid bandages’(1). The value of the technology was demonstrated in a proof-of-concept trial on dairy cows with the disease, digital dermatitis. This approach could address the significant impact this disease has on economic productivity in dairy farming and quality of life of the animals. In November 2020, NoBACZ Healthcare was established and product development began in earnest. After a robust period of proof of concept efficacy trial and development of tolerance and safety data. The first products were manufactured and launched in the UK at BCVA Congress in October 2023. (1)Bastos, C.A., et al., 2020. Robust rapid-setting antibacterial liquid bandages. Scientific reports, 10(1), pp.1-8 Our Innovation NoBACZ’s Precision Liquid Bandages will change the way that we care for animals and, ultimately, humans. Our products are innovative and adaptable. They set on application and are resistant to bacterial colonisation but are antibiotic free. The products prevent microbial ingress or biofilm formation on their surfaces, but do not leach or treat the wound. They are water resistant and do not require removing as they remove themselves over time. And they are composed of only sustainable and safe components that are all food or feed grade in an alcohol base. They can be used over pre-applied antiseptic, or over pre-applied veterinary medicinal products such as topical sprays. Precision Liquid Bandages thrive in extreme environments, from the demands of the modern dairy farm through to all-weather outdoor pursuits, every bit as much as they do in a clean hospital or home environment. Sign up to our Newsletter! Want to keep up to date with our latest news, publications and product information? About Us One Health Contact Us Report A Product Issue Privacy Policy Cookie Policy FAQs ©2023 by NoBACZ Healthcare.Website Design By ©2023 by NoBACZ Healthcare.Website Design By  ╳ ╳"
  },
  {
    "url": "https://nobacz.com/nobacz-bovine/",
    "content": "Bandages and farm environments are not a great match. To truly keep the environment out it’s time to rethink how we protect key areas like hooves, horn buds and udders. NoBACZ’s patented skin seal technology sets rapidly on contact with skin and provides a durable waterproof flexible cover that’s tough enough to withstand farm conditions. It’s antibiotic free – it consists of feed grade materials;  a combination of a natural polymer combined with copper and zinc ions in a surgical spirit base. On application it cleanses and seals the skin providing long standing protection for the affected area and keeping environmental pathogens out. About Us Our Technology One Health Contact Us Report A Product Issue Privacy Policy Cookie Policy FAQs ©2023 by NoBACZ Healthcare.Website Design By    ©2023 by NoBACZ Healthcare.Website Design By Available Now NoBACZ Bovine Bandages and farm environments are not a great match. To truly keep the environment out it’s time to rethink how we protect key areas like hooves, horn buds and udders. NoBACZ’s patented skin seal technology sets rapidly on contact with skin and provides a durable waterproof flexible cover that’s tough enough to withstand farm conditions. It’s antibiotic free – it consists of feed grade materials;  a combination of a natural polymer combined with copper and zinc ions in a surgical spirit base. On application it cleanses and seals the skin providing long standing protection for the affected area and keeping environmental pathogens out. Application Instruction Video NoBACZ Navel View Product NoBACZ Equine About Us Our Technology One Health Contact Us Report A Product Issue Privacy Policy Cookie Policy FAQs ©2023 by NoBACZ Healthcare.Website Design By ©2023 by NoBACZ Healthcare.Website Design By  ╳ ╳"
  },
  {
    "url": "https://nobacz.com/nobacz-navel/",
    "content": "Navel protection re-imagined to provide traditional cleansing with a lasting environmental barrier. NoBACZ’s patented skin seal technology sets rapidly on contact with navels and ear tags to provide lasting protection from environmental pathogens. It’s antibiotic free – it consists of feed grade materials;  a combination of a natural polymer combined with metal ions in a surgical spirit base. Use instead of your traditional navel treatment, can be applied by dipping or spraying. About Us Our Technology One Health Contact Us Report A Product Issue Privacy Policy Cookie Policy FAQs ©2023 by NoBACZ Healthcare.Website Design By    ©2023 by NoBACZ Healthcare.Website Design By Coming Soon! NoBACZ Navel Navel protection re-imagined to provide traditional cleansing with a lasting environmental barrier. NoBACZ’s patented skin seal technology sets rapidly on contact with navels and ear tags to provide lasting protection from environmental pathogens. It’s antibiotic free – it consists of feed grade materials;  a combination of a natural polymer combined with metal ions in a surgical spirit base. Use instead of your traditional navel treatment, can be applied by dipping or spraying. NoBACZ Bovine View Product NoBACZ Equine About Us Our Technology One Health Contact Us Report A Product Issue Privacy Policy Cookie Policy FAQs ©2023 by NoBACZ Healthcare.Website Design By ©2023 by NoBACZ Healthcare.Website Design By  ╳ ╳"
  },
  {
    "url": "https://nobacz.com/nobacz-equine/",
    "content": "Our equine product is currently in development. If you are interested in participating in our pre-launch trial work, please contact us. About Us Our Technology One Health Contact Us Report A Product Issue Privacy Policy Cookie Policy FAQs ©2023 by NoBACZ Healthcare.Website Design By    ©2023 by NoBACZ Healthcare.Website Design By Coming Soon! NoBACZ Equine Our equine product is currently in development. If you are interested in participating in our pre-launch trial work, please contact us. NoBACZ Bovine View Product NoBACZ Navel About Us Our Technology One Health Contact Us Report A Product Issue Privacy Policy Cookie Policy FAQs ©2023 by NoBACZ Healthcare.Website Design By ©2023 by NoBACZ Healthcare.Website Design By  ╳ ╳"
  },
  {
    "url": "https://nobacz.com/our-technology/",
    "content": "NoBACZ’s gels, sprays or liquid formulations only use dissolved components that are approved as food or feed additives in a standard surgical spirit (alcohol) solvent. The formulations generally contain one or more of a copper salt, zinc salt or iron salt, always at low levels and acting as spacers for natural polymer strands to form a robust 3 dimensional matrix. Any other excipients, such as dyes, where used, are also food or feed grade. This patented platform technology, spun out from the University of Cambridge, has great flexibility in its formulation approaches- e.g. some more durable, some more flexible, others quicker drying etc-allowing NoBACZ to meet different patient needs through its portfolio of products. These robust, adhesive ‘second skin’ barriers can be used alone or over the top of many compatible therapeutics. Fast and easy to apply they will repel mud, water, detritus and bacteria. They self degrade over time, negating the need for their removal, and are friendly to the environment. If you have a question please get in touch and we will get back to you as soon as possible About Us Our Technology One Health Contact Us Report A Product Issue Privacy Policy Cookie Policy FAQs ©2023 by NoBACZ Healthcare.Website Design By   Innovative Liquid Bandage Technology NoBACZ’s gels, sprays or liquid formulations only use dissolved components that are approved as food or feed additives in a standard surgical spirit (alcohol) solvent. The formulations generally contain one or more of a copper salt, zinc salt or iron salt, always at low levels and acting as spacers for natural polymer strands to form a robust 3 dimensional matrix. Any other excipients, such as dyes, where used, are also food or feed grade.   These robust, adhesive ‘second skin’ barriers can be used alone or over the top of many compatible therapeutics. Fast and easy to apply they will repel mud, water, detritus and bacteria. They self degrade over time, negating the need for their removal, and are friendly to the environment. * * * * * *  ©2023 by NoBACZ Healthcare.Website Design By Our Technology Innovative Liquid Bandage Technology NoBACZ’s gels, sprays or liquid formulations only use dissolved components that are approved as food or feed additives in a standard surgical spirit (alcohol) solvent. The formulations generally contain one or more of a copper salt, zinc salt or iron salt, always at low levels and acting as spacers for natural polymer strands to form a robust 3 dimensional matrix. Any other excipients, such as dyes, where used, are also food or feed grade. Platform Technology This patented platform technology, spun out from the University of Cambridge, has great flexibility in its formulation approaches- e.g. some more durable, some more flexible, others quicker drying etc-allowing NoBACZ to meet different patient needs through its portfolio of products. These robust, adhesive ‘second skin’ barriers can be used alone or over the top of many compatible therapeutics. Fast and easy to apply they will repel mud, water, detritus and bacteria. They self degrade over time, negating the need for their removal, and are friendly to the environment. Get In Touch If you have a question please get in touch and we will get back to you as soon as possible Fields marked with an * are required Name * Email * Postcode * Job Title * Message * Sign me up to hear more about NoBACZ's products and research* If you are a human seeing this field, please leave it empty. * We'll share updates no more than monthly and we won't share your contact details with third parties. See our About Us One Health Contact Us Report A Product Issue Privacy Policy Cookie Policy FAQs ©2023 by NoBACZ Healthcare.Website Design By See our  * We'll share updates no more than monthly and we won't share your contact details with third parties. See our ©2023 by NoBACZ Healthcare.Website Design By  ╳ ╳"
  }
]