[{"url": "https://www.gxigroup.com/cookie-policy/", "content": "Specialising in Fast-track End-to-end Office Fit Out and Refurbishments for Small & Medium Size Businesses This site uses cookies – small text files that are placed on your machine to help the site provide a better user experience. In general, cookies are used to retain user preferences, store information for things like shopping baskets, and provide anonymised tracking data to third party applications like Google Analytics. As a rule, cookies will make your browsing experience better. However, you may prefer to disable cookies on this site and on others. The most effective way to do this is to disable cookies in your browser. We suggest consulting the Help section of your browser or taking a look at  which offers guidance for all modern browsers. Devonshire House 582 Honeypot Lane Stanmore, Harrow London, HA7 1JS London Office: GXI Group 2-7 Clerkenwell Green London EC1R 0DE Company number: 03274123 -   -   Registered company name: GXI LTD | Company reg. no: 03274123         × * * * * * x This site uses cookies. Cookie Policy Our Work Company Our Services Contact Us - Registered company name: GXI LTD | Company reg. no: 03274123 × Request a call back from the GXI team First Name* Company* Last Name* Phone* Work Email* Preferred time Loading Your message has been sent. Thank you! Send Loading  Your message has been sent. Thank you!     Send"}, {"url": "https://www.gxigroup.com/", "content": ""}, {"url": "https://www.gxigroup.com/what-we-do/", "content": ""}, {"url": "https://www.gxigroup.com/what-we-do/design-space-planning/", "content": ""}, {"url": "https://www.gxigroup.com/what-we-do/office-refurbishment-fit-out/", "content": "Specialising in Fast-track End-to-end Office Fit Out and Refurbishments for Small & Medium Size Businesses / Office Refurbishment & Fit Out | Whether it is a small office refresh or a complete transformation – Shell & Core, Cat A or Cat B, GXI provide office refurbishment and fit out service to revitalise your workspace. We provide fully integrated service, right from planning and design, to build, furniture and aftercare.   Our office design and build approach is refreshingly transparent, truly personal and caringly responsible, and we have a lot of fun too. We really care about what we do which makes working with us, an exciting and stress-free experience for our clients. When client and employees are happy, business is good. So we take keen interest in understanding your business requirements and your employees needs and what they want out of the new workplace. Once this is established, we provide the right office design and refurbishment solution loved by everyone. So if you are looking for an end to end office refurbishment and fit out company in London, Harrow, Hertfordshire, Buckinghamshire, Surrey, Northampton, Southampton, Midlands or anywhere in the UK, call us. We will happily help. We will then analyse your office space and produce accurate CAD generated floor plans to help you visualise your new office layout that works for you. This is when you will already start dreaming about your beautiful office. We ensure that your office space is cleverly planned so that it helps you future-proof your business and office space requirements while enhancing the flexibility through innovative design. If you’d like and if it helps you, we can also visit some offices we have recently refurbished. Once the space is planned, we will conduct workshops with you and your key team members to decide the overall look, materials, designs, carpet, furniture etc. We will then virtually bring the workspace to life in 3D where you will see a great level of detail. We will even provide a walk-through which will virtually transport you to your new office. Now, it’s time for actual office refurbishment and fit out. It’s time to create a beautiful office with outstanding finishes. Our trusted team of experts will complete your work to the highest standards, on time and on budget. Our Interior Designers will oversee your entire office refurbishment and fit out process including aesthetics & finishes, fire safety & acoustics, and our Project Managers will oversee everything from site management, to logistics and health and safety. We have a pretty clean track record for delivering our projects on time and on budget. And if you need help organise an office warming party, we can do that too. Devonshire House 582 Honeypot Lane Stanmore, Harrow London, HA7 1JS London Office: GXI Group 2-7 Clerkenwell Green London EC1R 0DE Company number: 03274123 -   -   Registered company name: GXI LTD | Company reg. no: 03274123    / Office Refurbishment & Fit Out      * * * * * × * * * * * x This site uses cookies. Office Refurbishment & Fit Out furniture and aftercare. Our office design and build approach is refreshingly transparent, Our Office Refrubishment & Fit Out Process is Simple, Effective & Efficient Space Planning We ensure that your office space is cleverly planned so that it helps you future-proof your business and office space requirements while enhancing the flexibility through innovative design. If you’d like and if it helps you, we can also visit some offices we have recently refurbished. Designing your workplace Once the space is planned, we will conduct workshops with you and your key team members to decide the overall look, materials, designs, carpet, furniture etc. We will then virtually bring the workspace to life in 3D where you will see a great level of detail. We will even provide a walk-through which will virtually transport you to your new office. Office Refurbishment & Fit out Now, it’s time for actual office refurbishment and fit out. It’s time to create a beautiful office with outstanding finishes. Our trusted team of experts will complete your work to the highest standards, on time and on budget. Our Interior Designers will oversee your entire office refurbishment and fit out process including aesthetics & finishes, fire safety & acoustics, and our Project Managers will oversee everything from site management, to logistics and health and safety. Handover We have a pretty clean track record for delivering our projects on time and on budget. And if you need help organise an office warming party, we can do that too. Our Work Request a call back from the GXI team First Name* Company Last Name* Phone* Work Email* Your Message* Loading Your message has been sent. Thank you! Send Loading  Your message has been sent. Thank you!     Send Our Services Contact Us - Registered company name: GXI LTD | Company reg. no: 03274123 × Company* Preferred time"}, {"url": "https://www.gxigroup.com/what-we-do/office-partitions/", "content": "Specialising in Fast-track End-to-end Office Fit Out and Refurbishments for Small & Medium Size Businesses / Office Partition | With our vast experience in workplace refurbishment and installing office partitions in London and all over the UK, we know that there’s no one size fits all solution. Which is why our team always considers your business and workplace needs and then suggests the best partition solution. So if you are looking for office partition or glass partition in London, Harrow, Hertfordshire, Buckinghamshire, Surrey, Northampton, Southampton, Midlands, or anywhere in the UK, call us and we will be happy to help. When doing office partitions, these are some of the key things we consider: We only use the best material, may it be for glass partition, wooden partition, feature wall partition or any other solution for your partitioning needs. We’ll provide you with dedicated support throughout the length of your office partition project. Whether you simply need a small partition to create an interview space or partitioning as part of bigger office refurbishment project, we have the expertise to give you the best solution. We work with toughened, laminated, acoustic and fire rated glass Full Glass Wall: Minimising the barrier of partition by having glass from top to bottom to reduce visible boundaries and maximise natural light throughout the office. It uses an innovative interlocking panel system to ensure quick installation and a low amount of materials required to install the partition. Arty Glass Wall: Bring a bit of art into the office space by introducing some beautiful glass manifestation walls. Colours will bring character and glass will still maintain the openness. Fire Rated Glass Wall: We offer fire rated glass partition of various specifications and resistance – 30 minutes, 60 minutes, 90 minutes and 120 minutes. Made up of premium aluminium framing with strong plaster board, this is mainly used when privacy is required and there is no long term requirement for it to be moved. • Stud Partition: Premium aluminium along with steel studs and plasterboard offer durability, strength, termite protection and fire safety. • Fire Partition: With fire partitions, you have a way of protecting your office in the event of a fire. All our fire partitions are constructed out of fire-rated plasterboards made from fire-resistant materials that prevent the spread of fire. Based on regulations and requirements, we use plasterboard to provide fire resistance of 30 minutes, 60 minutes, 90 minutes and 120 minutes. We are specialists in fire-rated partitions. All our partitions have a pre-determined fire resistance performance as per European standards Glass Fire Partition: GXI provide specialist fire partition systems based on regulations and requirements. Our expert installers are professionally trained for installing fire partition systems. The fire-rated glass we use can provide fire resistance of up to 30 minutes, 60 minutes, 90 minutes and 120 minutes depending on your requirement. It adheres to all health and safety regulations and provides peace of mind. Solid Fire Partition:  With fire partitions, you have a way of protecting your office in the event of a fire. All our fire partitions are constructed out of fire-rated plasterboards made from fire-resistant materials that prevent the spread of fire. Based on regulations and requirements, we use plasterboards which are fully tested to achieve a fire resistance rating of up to 30 minutes, 60 minutes, 90 minutes and 120 minutes. Here’s a bit about fire partition glass you might want to know Fire Classifications to EN 357 E30, E60, E90, E120 (30/0, 60/0, 90/0, 120/0) Integrity only Does not stop heat transfer through EW30, EW60 Integrity & radiated heat control Stops only partial heat transfer through glass/profiles EI30, EI60, EI90, EI120 (30/30, 60/60, 90/90, 120/120) Integrity & Insulation Stops heat transfer through both glass & profiles Devonshire House 582 Honeypot Lane Stanmore, Harrow London, HA7 1JS London Office: GXI Group 2-7 Clerkenwell Green London EC1R 0DE Company number: 03274123 -   -   Registered company name: GXI LTD | Company reg. no: 03274123    / Office Partition      * * * * * × * * * * * Existing framework of the premises How to plan the space effectively How partition can enhance your organisation’s culture and identity Utilising natural light Fire and Safety regulations Sound transmission Style, comfort and flexible working x This site uses cookies. Existing framework of the premises How to plan the space effectively How partition can enhance your organisation’s culture and identity Utilising natural light Fire and Safety regulations Sound transmission Style, comfort and flexible working Various office partitioning solutions we offer Glass Partition & Fire Rated Glass Partition Solid Partition Walls Fire Resistant Partition Our Work Request a call back from the GXI team First Name* Company Last Name* Phone* Work Email* Your Message* Loading Your message has been sent. Thank you! Send Loading  Your message has been sent. Thank you!     Send Our Services Contact Us - Registered company name: GXI LTD | Company reg. no: 03274123 × Company* Preferred time"}, {"url": "https://www.gxigroup.com/what-we-do/electrical-data-infrastructure/", "content": "Specialising in Fast-track End-to-end Office Fit Out and Refurbishments for Small & Medium Size Businesses / IT Infrastructure With IT Infrastructure one size fits all approach no longer works. Every business has their specific requirements for when it comes to IT & Networking. At GXI, we provide reliable, scalable and cost-effective IT & Networking solutions that supports new technologies and drives high performance to suit every client’s needs. Our IT consultants take the time to understand your requirements and provide an IT network which meets your business goals. We provide leading-edge technology from major manufacturers to ensure trust and longevity of the netwrok solutions we provide. CCTV is essential for protecting your people, premises and property. It’s easy to check what’s happening in your workspace and other premises ANYTIME from ANYWHERE even from a mobile and you can even record it. At GXI, we advise on the best CCTV systems, cameras and take care of all the installations, training and after sales support. We provide CCTV solutions which are compliant to NSI Code of Practice. • Day & Night Cameras, High Res, Wide Angle and Covert Cameras • Face Recognition Cameras • Mobile App Configuration • Remote Viewing System • After Sales Support • Digital Video Recording • Complete Installation & Training Cabling is the backbone for all your network communications. Keeping your communications operating smoothly is absolutely essential for any business and also one of the biggest issues facing a lot of the businesses. Old or poorly installed network cabling can cause major inconvenience in smooth functioning of a business and incur unnecessary cost. GXI offers a range of options for your voice and data cabling needs and help advice on the right type and category to best suit your requirements. There are currently 2 main types of cabling; • Fibre • Copper (Cat 5, Cat 6, Cat 6a and Cat 7) The cabling we install complies with international and European standards so you can be assured of quality cabling with every installation. Our services include design, installation, implementation and testing of all current and future Data and Voice cable needs, including Fibre Optics, Cat 5, Cat 6, Cat 6a and Cat 7 Ethernet and all types of Voice cable. We provide: • Warranty on all installations • Fibre-optic installations and testing • Compliance testing • VoIP infrastructure specialists • Fully qualified engineers • Full test documentation At GXI, we will help you choose the right phone system for your business. When choosing a phone system for your office, you need to consider several aspects to ensure you get the most appropriate solution that best fits your needs. Depending on the nature and requirements of your business, do you need a full phone system that includes physical desk phones, or could you do it with a virtual phone system that relies on remote lines and mobile devices? If you do need desk phones, you can either go with Voice over Internet Protocol (VoIP) system, which is internet based or you could use a traditional landline telephone service. If you choose VoIP system, you can either house the system at your business premises (Self-hosted VoIP) or have the service provider host it (Cloud-based VoIP) Businesses are no more restricted to having just one choice when it comes to their phone system. Gone are the days when everyone used a landline system. The internet and mobile phones have given businesses several types of new phone systems to choose from. We can offer all types of phone systems. The key system is a multi-line phone system supported by a central control device for connectivity. Features: Key Systems offer all the basic features such as hold buttons, speakerphone, intercom, and paging. Pros: It’s an easy-to-use system, relatively comparable to a home phone system. Cons: It’s not portable and flexible. Ideal for: Smaller organisations with fewer than 50 employees. This system uses your internet connection. Features: Automated answering, call waiting, mobile and calling through computers. Pros: Easy to set-up, cheaper than landline and a lot of extra features. Cons: The VoIP system is heavily reliant on internet connection. Ideal for: Sophisticated phone systems for cheap. Branch exchange owned and operated by the host. Features: Offers control of infrastructure and security. Pros: Run and configured as per business needs. Cons: Significant cost for equipment, maintenance and staff. Ideal for: Bigger businesses that want more control and don’t want to rely on a provider. Hosted and maintained by a remote provider for a fee. Features: Access to all the features from the provider and is quick to set-up. Pros: No equipment purchase cost and can be easily configured based on business needs. Cons: Lack of control. If the system goes down, you have to rely on the provider. Ideal for: Growing businesses with minimum or no IT staff. It is important that you use the right broadband and is appropriately set-up for your workplace 1. Conduct a site survey to determine proper access point for your network setup 2. Choose the right equipment and hardware to suit your business needs 3. Do the wiring considering aesthetics when setting up the wi-fi When recommending and setting up wi-fi, we consider these key points: • High speed, secure and scalable wi-fi across all office premises • Easily accessible guest wi-fi page, which is fully customisable. • Compliant with various laws     • Easy to connect wi-fi options i.e. free login or tiered logins or social media plug-ins • Seamless streaming and downloading experience Devonshire House 582 Honeypot Lane Stanmore, Harrow London, HA7 1JS London Office: GXI Group 2-7 Clerkenwell Green London EC1R 0DE Company number: 03274123 -   -   Registered company name: GXI LTD | Company reg. no: 03274123    / IT Infrastructure      × * * * * * x This site uses cookies. Electrical & Data Infrastructure IT & Networking CCTV Expertise to deliver: • Day & Night Cameras, High Res, Wide Angle and Covert Cameras • Face Recognition Cameras • Mobile App Configuration • Remote Viewing System • After Sales Support • Digital Video Recording • Complete Installation & Training Structured Cabling • Warranty on all installations • Fibre-optic installations and testing • Compliance testing • VoIP infrastructure specialists • Fully qualified engineers • Full test documentation Complex Phone System Features: Key Systems offer all the basic features such as hold buttons, speakerphone, intercom, and paging. Pros: It’s an easy-to-use system, relatively comparable to a home phone system. Cons: It’s not portable and flexible. Ideal for: Smaller organisations with fewer than 50 employees. Features: Automated answering, call waiting, mobile and calling through computers. Pros: Easy to set-up, cheaper than landline and a lot of extra features. Cons: The VoIP system is heavily reliant on internet connection. Ideal for: Sophisticated phone systems for cheap. Features: Offers control of infrastructure and security. Pros: Run and configured as per business needs. Cons: Significant cost for equipment, maintenance and staff. Ideal for: Bigger businesses that want more control and don’t want to rely on a provider. Features: Access to all the features from the provider and is quick to set-up. Pros: No equipment purchase cost and can be easily configured based on business needs. Cons: Lack of control. If the system goes down, you have to rely on the provider. Ideal for: Growing businesses with minimum or no IT staff. Wi-fi 1. Conduct a site survey to determine proper access point for your network setup 2. Choose the right equipment and hardware to suit your business needs 3. Do the wiring considering aesthetics when setting up the wi-fi When recommending and setting up wi-fi, we consider these key points: • High speed, secure and scalable wi-fi across all office premises • Easily accessible guest wi-fi page, which is fully customisable. • Compliant with various laws • Easy to connect wi-fi options i.e. free login or tiered logins or social media plug-ins • Seamless streaming and downloading experience Our Work Company Our Services Contact Us - Registered company name: GXI LTD | Company reg. no: 03274123 × Request a call back from the GXI team First Name* Company* Last Name* Phone* Work Email* Preferred time Loading Your message has been sent. Thank you! Send Loading  Your message has been sent. Thank you!     Send"}, {"url": "https://www.gxigroup.com/office-furniture/", "content": "Specialising in Fast-track End-to-end Office Fit Out and Refurbishments for Small & Medium Size Businesses Office Furniture is part of GXI’s DNA. We believe that furniture is as much function as style. We work with leading brands around the world on a regular basis and have established trust and excellent relationships. Our team of specialist designers & furniture consultants travel around the world to source beautiful modern office furniture cherry-picked from hundreds of suppliers for all your workplace furniture needs. We work with you and your staff to understand your office furniture requirements and make it a comfortable and an attractive workplace. After which we manage the entire process from selection, delivery and installation and make sure that everything goes to plan, so that you can plan your night outs and family holidays. And if you want something bespoke created, don’t lose sleep, we can do that too with a guarantee that it will perfectly match your specifications. We only work with suppliers who, like us, believe in quality and service. Devonshire House 582 Honeypot Lane Stanmore, Harrow London, HA7 1JS London Office: GXI Group 2-7 Clerkenwell Green London EC1R 0DE Company number: 03274123 -   -   Registered company name: GXI LTD | Company reg. no: 03274123         × * * * * * x This site uses cookies. Our Furniture Our Range Understanding your needs Call or Email Us Our Work Company Our Services Contact Us - Registered company name: GXI LTD | Company reg. no: 03274123 × Request a call back from the GXI team First Name* Company* Last Name* Phone* Work Email* Preferred time Loading Your message has been sent. Thank you! Send Loading  Your message has been sent. Thank you!     Send"}, {"url": "https://www.gxigroup.com/what-we-do/workplace-consultancy/", "content": "Specialising in Fast-track End-to-end Office Fit Out and Refurbishments for Small & Medium Size Businesses / Workplace Consultancy In order to make informed decidions on new working strategies, and staff wellbeing, you need accurate and reliable data assessing your current workplace and future workplace requirements. A well thought through workplace strategy will help make better use of your existing or future space and increase overall efficiency. This process of discovering strategically what your organisation needs to improve your workplace efficiency is Workplace Consultancy. The Workplace Consultancy process has 5 stages: This process could take 4 – 8 weeks depending on the needs of the client and size of the workplace. Workplace consultancy is valuable for any business going through a phase of growth or consolidation, relocation or refurbishment or even re-branding or change of management Devonshire House 582 Honeypot Lane Stanmore, Harrow London, HA7 1JS London Office: GXI Group 2-7 Clerkenwell Green London EC1R 0DE Company number: 03274123 -   -   Registered company name: GXI LTD | Company reg. no: 03274123    / Workplace Consultancy Increased productivity & performance Reduced real-estate cost Talent attraction, retention & engagement Workplace accurately reflects the brand, culture & values Improved communication & collaboration A flexible workforce and organisation Improved employee wellbeing & reduced sickness Futureproofed office      × * * * * * Key Stakeholder Workshop Space & Occupancy Study Staff Survey – Online / Employee Engagement Workshop Recommendations & Consolidation Implementation Increased productivity & performance Reduced real-estate cost Talent attraction, retention & engagement Workplace accurately reflects the brand, culture & values Improved communication & collaboration A flexible workforce and organisation Improved employee wellbeing & reduced sickness Futureproofed office x This site uses cookies. What is Workplace Consultancy? How it works? The Workplace Consultancy process has 5 stages: Key Stakeholder Workshop Space & Occupancy Study Staff Survey – Online / Employee Engagement Workshop Recommendations & Consolidation Implementation This process could take 4 – 8 weeks Benefits of Workplace Consultancy? Increased productivity & performance Reduced real-estate cost Talent attraction, retention & engagement Workplace accurately reflects the brand, culture & values Improved communication & collaboration A flexible workforce and organisation Improved employee wellbeing & reduced sickness Futureproofed office Our Work Company Our Services Contact Us - Registered company name: GXI LTD | Company reg. no: 03274123 × Request a call back from the GXI team First Name* Company* Last Name* Phone* Work Email* Preferred time Loading Your message has been sent. Thank you! Send Loading  Your message has been sent. Thank you!     Send"}, {"url": "https://www.gxigroup.com/what-we-do/return-to-work/", "content": "Specialising in Fast-track End-to-end Office Fit Out and Refurbishments for Small & Medium Size Businesses Businesses are returning to work and GXI are helping them return with safety and well-being of their employees at the forefront. GXI are offering these protective measures against Coronavirus without having to compromise on aesthetics of the workplace.   Flexible & easy: These Social Distancing screens are very easy to install and available in various sizes. Return screen: In addition to Central Screens, Return Screens can also be easily installed for protection from the sides Visual Openness: Employees can still see one another in open plan but reduce the risk of airborne germs between them. Hygienic: These are easy to clean and disinfect Aesthetics: Maintains the aesthetics of the office.   Flexible & easy: These Social Distancing Screens are very easy to install using metal brackets/clamps and available in various sizes. Greater Protection: All Solo Return Screens extend 200mm beyond worksurface, offering greater protection between colleagues working adjacent Visual Openness: Employees can still see one another in open plan but reduce the risk of airborne germs between them. Hygienic: These are easy to clean and disinfect Aesthetics: Maintains the aesthetics of the office.   Flexible & easy: These Social Distancing Screens are very easy to install on top of any existing screens using metal brackets/clamps and available in various sizes. Visual Openness: Employees can still see one another in open plan but reduce the risk of airborne germs between them. Hygienic: These are easy to clean and disinfect Aesthetics: Maintains the aesthetics of the office.   Flexible & easy: These Social Distancing Screens are very easy to install. Don’t require fixing to furniture or floor. Customisable & Modular: Most freestanding screens are customisable and modular in terms of length Visual Openness: Employees can still see one another in open plan but reduce the risk of airborne germs between them. Hygienic: These are easy to clean and disinfect Movable: Since these are freestanding, they are easily movable. Some even have wheels on them Aesthetics: Maintains the aesthetics of the office   No holes: As it doesn’t need to be fixed to a desk, there won’t be any holes on the furniture Pinnable surface: Felt provides a pinnable surface to put a picture of your children, grand children or anyone else. Flexible & easy to install: These are simple push-on screens and can be easily installed for Social Distancing Colour Choice: Available in 17 colours to match your office decor Delivery: Fast lead times Privacy: Felt material provides acoustic and visual privacy Environment Friendly: Sustainable and 100% recyclable, made of 60% recyclable content   No holes: As it doesn’t need to be fixed to a desk, there won’t be any holes on the furniture Flexible and easy to configure: These Social Distancing Screens are simple and easy to configure and re-configure and are available in straight, curved and corner screen options Colour Choice: Available in light grey and dark grey Delivery: Fast lead times Privacy: Felt material provides acoustic and visual privacy Environment Friendly: Sustainable and 100% recyclable Lightweight: The material used is lightweight but sturdy   Health & Safety:  Evaluate risks posed to employees who are working and risks arising from operations. Checklist: Handy checklist which will help with Safety assessment. Space Planning for all of these areas: Combo Features: Compact Features:   Pedal Activated Features:   Increased hygiene procedures: As per the new protocol, employers should provide disinfectant wipes and hand sanitizers throughout the office. For additional protection, masks and gloves can be provided to make the employees feel safe. Protective Head Visor This super light protective visor is designed to protect your whole face from sneeze and cough. It is built with soft support for the forehead making it comfortable to wear. The protective visor is lasting and reusable as it can be easily cleaned. Features Devonshire House 582 Honeypot Lane Stanmore, Harrow London, HA7 1JS London Office: GXI Group 2-7 Clerkenwell Green London EC1R 0DE Company number: 03274123 -   -   Registered company name: GXI LTD | Company reg. no: 03274123    × × × × × × × × × ×      × * * * * * Site Access and Egress Points Workstation Planning – 2meter Social Distancing rule Canteen & Breakout Areas Changing Facilities, Showers and Drying Rooms Automatic – Motion Censor Contact free Sanitiser, Gloves, Waste Container Free-standing W x D X H: 520mm x 400mm x 1,495mm Automatic – Motion Censor Contact free Sanitiser Desktop / Wall W x D X H: 310mm x 235mm x 550mm Hands Free Pedal Activated Free Standing Made from Stainless Steel 100% Mechanical Light Soft support for the forehead Re-usable Easily cleaned Entire face protected from sneeze & cough x This site uses cookies. COVID-19 Protection – Return to Work Range protective measures against Coronavirus without having to compromise on aesthetics of the workplace. × COVID-19 Protection Screens – Solo Flexible & easy: These Social Distancing screens are very easy to install and available in various sizes. Return screen: In addition to Central Screens, Return Screens can also be easily installed for protection from the sides Visual Openness: Employees can still see one another in open plan but reduce the risk of airborne germs between them. Hygienic: These are easy to clean and disinfect Aesthetics: Maintains the aesthetics of the office. COVID-19 Protection Screens – Solo Return Flexible & easy: These Social Distancing Screens are very easy to install using metal brackets/clamps and available in various sizes. Greater Protection: All Solo Return Screens extend 200mm beyond worksurface, offering greater protection between colleagues working adjacent COVID-19 Protection Screens – Screen Topper Flexible & easy: These Social Distancing Screens are very easy to install on top of any existing screens using metal brackets/clamps and available in various sizes. COVID-19 Protection Screens – Freestanding Flexible & easy: These Social Distancing Screens are very easy to install. Don’t require fixing to furniture or floor. Customisable & Modular: Most freestanding screens are customisable and modular in terms of length Movable: Since these are freestanding, they are easily movable. Some even have wheels on them Aesthetics: Maintains the aesthetics of the office COVID-19 Protection Screens – Felt Screen Set No holes: As it doesn’t need to be fixed to a desk, there won’t be any holes on the furniture Pinnable surface: Felt provides a pinnable surface to put a picture of your children, grand children or anyone else. Flexible & easy to install: These are simple push-on screens and can be easily installed for Social Distancing Colour Choice: Available in 17 colours to match your office decor Delivery: Fast lead times Privacy: Felt material provides acoustic and visual privacy Environment Friendly: Sustainable and 100% recyclable, made of 60% recyclable content COVID-19 Protection Screens – Felt Work Box Flexible and easy to configure: These Social Distancing Screens are simple and easy to configure and re-configure and are available in straight, curved and corner screen options Colour Choice: Available in light grey and dark grey Environment Friendly: Sustainable and 100% recyclable Lightweight: The material used is lightweight but sturdy Space Planning for Social Distancing Health & Safety:  Evaluate risks posed to employees who are working and risks arising from operations. Checklist: Handy checklist which will help with Safety assessment. Space Planning for all of these areas: Site Access and Egress Points Workstation Planning – 2meter Social Distancing rule Canteen & Breakout Areas Changing Facilities, Showers and Drying Rooms Contact free Hand Disinfection Station Combo Features: Automatic – Motion Censor Contact free Sanitiser, Gloves, Waste Container Free-standing W x D X H: 520mm x 400mm x 1,495mm Compact Sanitiser Desktop / Wall W x D X H: 310mm x 235mm x 550mm Pedal Activated Hands Free Free Standing Made from Stainless Steel 100% Mechanical Workplace PPE Increased hygiene procedures: As per the new protocol, employers should provide disinfectant wipes and hand sanitizers throughout the office. For additional protection, masks and gloves can be provided to make the employees feel safe. Protective Head Visor This super light protective visor is designed to protect your whole face from sneeze and cough. It is built with soft support for the forehead making it comfortable to wear. The protective visor is lasting and reusable as it can be easily cleaned. Features Light Soft support for the forehead Re-usable Easily cleaned Entire face protected from sneeze & cough Social Distancing Signage Our Work Company Our Services Contact Us - Registered company name: GXI LTD | Company reg. no: 03274123 Request a call back from the GXI team First Name* Company* Last Name* Phone* Work Email* Preferred time Loading Your message has been sent. Thank you! Send Loading  Your message has been sent. Thank you!     Send"}, {"url": "https://www.gxigroup.com/our-work/", "content": "Specialising in Fast-track End-to-end Office Fit Out and Refurbishments for Small & Medium Size Businesses Devonshire House 582 Honeypot Lane Stanmore, Harrow London, HA7 1JS London Office: GXI Group 2-7 Clerkenwell Green London EC1R 0DE Company number: 03274123 -   -   Registered company name: GXI LTD | Company reg. no: 03274123         × * * * * * x This site uses cookies. Our Work Company Our Services Contact Us - Registered company name: GXI LTD | Company reg. no: 03274123 × Request a call back from the GXI team First Name* Company* Last Name* Phone* Work Email* Preferred time Loading Your message has been sent. Thank you! Send Loading  Your message has been sent. Thank you!     Send"}, {"url": "https://www.gxigroup.com/about-us/", "content": "Specialising in Fast-track End-to-end Office Fit Out and Refurbishments for Small & Medium Size Businesses For over 20 years we have been creating modern and stylish workspaces all over the UK. We take time to understand our client’s business and its requirements and then create beautiful  which encourage intelligent and efficient working and help increase productivity. Our team of specialists have extensive knowledge and experience in their key area of expertise. May it be  teams, electricians, plumbers, AC’s installers,  partners and project managers, they love working as a team. They do get along. It helps. Our approach is refreshingly transparent, truly personal and caringly responsible, and we have a lot of fun too. We genuinely love and really care about what we do which makes working with us an exciting and stress free experience. We have worked on projects ranging from small offices to an entire building of serviced offices. Projects completed SINCE 2000 Design and built over SQ FT Locations covered WITHIN THE UK We believe that  is as much about function as style. We have worked with clients from diverse industries, right from banking, accountants and law firms, through to cafes, hotels, housing associations, serviced offices and many more. The type of projects we have handled are offices, warehouses, universities, hotels, spas and many more. Devonshire House 582 Honeypot Lane Stanmore, Harrow London, HA7 1JS London Office: GXI Group 2-7 Clerkenwell Green London EC1R 0DE Company number: 03274123 -   -   Registered company name: GXI LTD | Company reg. no: 03274123          Call: Email: * * * * *      × * * * * * x This site uses cookies. About GXI Transforming Office & Commercial Spaces About GXI About GXI We are equally enthusiastic about every project building of serviced offices. Projects completed 274 SINCE 2000 Design and built over 2 Million SQ FT Locations covered 18 WITHIN THE UK Our Interior Designers travel around the world to source tasteful furniture for our clients. Diverse Experience serviced offices and many more. The type of projects we have handled Ready to kickstart your Call: Email: First Name* Company Last Name* Phone* Email* Your Message* Loading Send Loading       Send Our Work Our Services Contact Us - Registered company name: GXI LTD | Company reg. no: 03274123 × Request a call back from the GXI team Company* Work Email* Preferred time Your message has been sent. Thank you! Loading  Your message has been sent. Thank you!     Send"}, {"url": "https://www.gxigroup.com/contact/", "content": "Specialising in Fast-track End-to-end Office Fit Out and Refurbishments for Small & Medium Size Businesses Devonshire House 582 Honeypot Lane Stanmore, Harrow London, HA7 1JS London Office: GXI Group 2-7 Clerkenwell Green London EC1R 0DE Company number: 03274123 -   -   Registered company name: GXI LTD | Company reg. no: 03274123    Call: Email: * * * * *      × * * * * * x This site uses cookies. Contact Us Call: Email: First Name* Company Last Name* Phone* Email* Your Message* Loading Send Loading       Send Our Work Our Services - Registered company name: GXI LTD | Company reg. no: 03274123 × Request a call back from the GXI team Company* Work Email* Preferred time Your message has been sent. Thank you! Loading  Your message has been sent. Thank you!     Send"}, {"url": "https://www.gxigroup.com/#", "content": "Specialising in Fast-track End-to-end Office Fit Out and Refurbishments for Small & Medium Size Businesses We are a team of passionate people who specialise in end-to-end office office fit out and refurbishment for over 20 years. Our design & fit out approach is refreshingly transparent,truly personal and caringly responsible, and we have a lot of fun too. We genuinely love and really care about what we do which makes working with us an exciting and stress-free experience. When we say end to end solutions, we mean it. We work with you from the outset. Right from securing office premises through to building regulations, fire safety, renovation, refurbishment, fit out and furniture. What makes us different is our passionate enthusiasm for every project, be it small offices to an entire building of serviced offices. GXI have proudly completed hundreds of office and commercial space fit out and refurbishment projects in London, Bristol, Southampton, Birmingham, Manchester, Aberdeen, Middlesex, Elstree, Milton Keynes, Leicester, Croydon, Gatwick, Harrow, Slough, Stevenage, Leeds, Wokingham, Watford, Borehamwood, Reading, High Wycombe, Kent. We have helped fit out, renovate, refurbish offices and commercial workspaces for several clients from diverse industries, right from banks, recruitment companies and accountants, through to cafes, hotels, solicitors & law firms, housing associations, educational institutions, investors and many more. The type of Office Refurbishment and Fit Out projects we have handled are small, medium and large offices, warehouses, universities,hotels, spas, entire block of serviced offices and more. Our strength is our Interior Designers and team of experts who have extensive experience in creating gorgeous offices & workspaces with highest service. They combine design, commercial, and technical knowledge to provide the best experience, all at an affordable cost to fit out office space. Overall, office fit out cost  depends on a wide range of factors like the size of office space, facilities created, materials used, furniture sourced, and many more. Based on all these factors, the prices for office fit out and refurbishment may vary for different projects, however, this will give you a rough idea of ballpark office fit-out costs per square foot before starting your project. If you’ve got a new office space as shell and core and need to do CAT A and CAT B, here’s a list of cost you should be looking at: While CAT A fit out focuses on the basics of office build including floor work, ceiling works, basic mechanical and electrical services, CAT B fit-out is the next step that completes the designing process. Here is the list of CAT A + CAT B fit-out costs: CAT B only focuses on transforming the CAT A structure and giving it the final look. It includes works related to partition, finishes, design, furniture, etc.  Here is the list of pricing for CAT B only: These are typical figures based on past projects. However, office fit-out costs per square foot  may vary based on several factors. The final price will be fixed based on many factors like base structure and HVAC requirements of your office building. Devonshire House 582 Honeypot Lane Stanmore, Harrow London, HA7 1JS London Office: GXI Group 2-7 Clerkenwell Green London EC1R 0DE Company number: 03274123 -   -   Registered company name: GXI LTD | Company reg. no: 03274123           × * * * * * When we say end to end solutions, we mean it. We work with you from the outset. Right from securing office premises through to building regulations, fire safety, renovation, refurbishment, fit out and furniture. What makes us different is our passionate enthusiasm for every project, be it small offices to an entire building of serviced offices. GXI have proudly completed hundreds of office and commercial space fit out and refurbishment projects in London, Bristol, Southampton, Birmingham, Manchester, Aberdeen, Middlesex, Elstree, Milton Keynes, Leicester, Croydon, Gatwick, Harrow, Slough, Stevenage, Leeds, Wokingham, Watford, Borehamwood, Reading, High Wycombe, Kent. We have helped fit out, renovate, refurbish offices and commercial workspaces for several clients from diverse industries, right from banks, recruitment companies and accountants, through to cafes, hotels, solicitors & law firms, housing associations, educational institutions, investors and many more. The type of Office Refurbishment and Fit Out projects we have handled are small, medium and large offices, warehouses, universities,hotels, spas, entire block of serviced offices and more. Our strength is our Interior Designers and team of experts who have extensive experience in creating gorgeous offices & workspaces with highest service. They combine design, commercial, and technical knowledge to provide the best experience, all at an affordable cost to fit out office space. Overall, office fit out cost  depends on a wide range of factors like the size of office space, facilities created, materials used, furniture sourced, and many more. Based on all these factors, the prices for office fit out and refurbishment may vary for different projects, however, this will give you a rough idea of ballpark office fit-out costs per square foot before starting your project. x This site uses cookies. Office Design Office Fit Out Office Refurbishment Office Furniture Office Experts Office Design Office Fit Out Office Refurbishment Office Furniture Office Experts What We Do Our Projects Who We Are GXI Group provide end–to–end office fit out, refurbishment & furniture solutions When we say end to end solutions, we mean it. We work with you from the outset. Right from securing office premises through to building regulations, fire safety, renovation, refurbishment, fit out and furniture. What makes us different is our passionate enthusiasm for every project, be it small offices to an entire building of serviced offices. GXI have proudly completed hundreds of office and commercial space fit out and refurbishment projects in London, Bristol, Southampton, Birmingham, Manchester, Aberdeen, Middlesex, Elstree, Milton Keynes, Leicester, Croydon, Gatwick, Harrow, Slough, Stevenage, Leeds, Wokingham, Watford, Borehamwood, Reading, High Wycombe, Kent. We have helped fit out, renovate, refurbish offices and commercial workspaces for several clients from diverse industries, right from banks, recruitment companies and accountants, through to cafes, hotels, solicitors & law firms, housing associations, educational institutions, investors and many more. The type of Office Refurbishment and Fit Out projects we have handled are small, medium and large offices, warehouses, universities,hotels, spas, entire block of serviced offices and more. How much does Office fit out cost in London, UK? Our strength is our Interior Designers and team of experts who have extensive experience in creating gorgeous offices & workspaces with highest service. They combine design, commercial, and technical knowledge to provide the best experience, all at an affordable cost to fit out office space. Overall, office fit out cost  depends on a wide range of factors like the size of office space, facilities created, materials used, furniture sourced, and many more. Based on all these factors, the prices for office fit out and refurbishment may vary for different projects, however, this will give you a rough idea of ballpark office fit-out costs per square foot before starting your project. If you’ve got a new office space as shell and core and need to do CAT A and CAT B, here’s a list of cost you should be looking at: 1) CAT A + CAT B While CAT A fit out focuses on the basics of office build including floor work, ceiling works, basic mechanical and electrical services, CAT B fit-out is the next step that completes the designing process. Here is the list of CAT A + CAT B fit-out costs: Cost Factors Cost Construction £20 - £60+ Mechanical £25 - £35+ Electrical Network Infrastructure Furniture £6 - £16+ 2)CAT B only CAT B only focuses on transforming the CAT A structure and giving it the final look. It includes works related to partition, finishes, design, furniture, etc. Here is the list of pricing for CAT B only: £12 - £25+ £6 - £10+ These are typical figures based on past projects. However, office fit-out costs per square foot  may vary based on several factors. The final price will be fixed based on many factors like base structure and HVAC requirements of your office building. Our Work Company Our Services Contact Us - Registered company name: GXI LTD | Company reg. no: 03274123 × Request a call back from the GXI team First Name* Company* Last Name* Phone* Work Email* Preferred time Loading Your message has been sent. Thank you! Send Loading  Your message has been sent. Thank you!     Send"}, {"url": "https://www.gxigroup.com/#heroCarousel", "content": "Specialising in Fast-track End-to-end Office Fit Out and Refurbishments for Small & Medium Size Businesses We are a team of passionate people who specialise in end-to-end office office fit out and refurbishment for over 20 years. Our design & fit out approach is refreshingly transparent,truly personal and caringly responsible, and we have a lot of fun too. We genuinely love and really care about what we do which makes working with us an exciting and stress-free experience. When we say end to end solutions, we mean it. We work with you from the outset. Right from securing office premises through to building regulations, fire safety, renovation, refurbishment, fit out and furniture. What makes us different is our passionate enthusiasm for every project, be it small offices to an entire building of serviced offices. GXI have proudly completed hundreds of office and commercial space fit out and refurbishment projects in London, Bristol, Southampton, Birmingham, Manchester, Aberdeen, Middlesex, Elstree, Milton Keynes, Leicester, Croydon, Gatwick, Harrow, Slough, Stevenage, Leeds, Wokingham, Watford, Borehamwood, Reading, High Wycombe, Kent. We have helped fit out, renovate, refurbish offices and commercial workspaces for several clients from diverse industries, right from banks, recruitment companies and accountants, through to cafes, hotels, solicitors & law firms, housing associations, educational institutions, investors and many more. The type of Office Refurbishment and Fit Out projects we have handled are small, medium and large offices, warehouses, universities,hotels, spas, entire block of serviced offices and more. Our strength is our Interior Designers and team of experts who have extensive experience in creating gorgeous offices & workspaces with highest service. They combine design, commercial, and technical knowledge to provide the best experience, all at an affordable cost to fit out office space. Overall, office fit out cost  depends on a wide range of factors like the size of office space, facilities created, materials used, furniture sourced, and many more. Based on all these factors, the prices for office fit out and refurbishment may vary for different projects, however, this will give you a rough idea of ballpark office fit-out costs per square foot before starting your project. If you’ve got a new office space as shell and core and need to do CAT A and CAT B, here’s a list of cost you should be looking at: While CAT A fit out focuses on the basics of office build including floor work, ceiling works, basic mechanical and electrical services, CAT B fit-out is the next step that completes the designing process. Here is the list of CAT A + CAT B fit-out costs: CAT B only focuses on transforming the CAT A structure and giving it the final look. It includes works related to partition, finishes, design, furniture, etc.  Here is the list of pricing for CAT B only: These are typical figures based on past projects. However, office fit-out costs per square foot  may vary based on several factors. The final price will be fixed based on many factors like base structure and HVAC requirements of your office building. Devonshire House 582 Honeypot Lane Stanmore, Harrow London, HA7 1JS London Office: GXI Group 2-7 Clerkenwell Green London EC1R 0DE Company number: 03274123 -   -   Registered company name: GXI LTD | Company reg. no: 03274123           × * * * * * When we say end to end solutions, we mean it. We work with you from the outset. Right from securing office premises through to building regulations, fire safety, renovation, refurbishment, fit out and furniture. What makes us different is our passionate enthusiasm for every project, be it small offices to an entire building of serviced offices. GXI have proudly completed hundreds of office and commercial space fit out and refurbishment projects in London, Bristol, Southampton, Birmingham, Manchester, Aberdeen, Middlesex, Elstree, Milton Keynes, Leicester, Croydon, Gatwick, Harrow, Slough, Stevenage, Leeds, Wokingham, Watford, Borehamwood, Reading, High Wycombe, Kent. We have helped fit out, renovate, refurbish offices and commercial workspaces for several clients from diverse industries, right from banks, recruitment companies and accountants, through to cafes, hotels, solicitors & law firms, housing associations, educational institutions, investors and many more. The type of Office Refurbishment and Fit Out projects we have handled are small, medium and large offices, warehouses, universities,hotels, spas, entire block of serviced offices and more. Our strength is our Interior Designers and team of experts who have extensive experience in creating gorgeous offices & workspaces with highest service. They combine design, commercial, and technical knowledge to provide the best experience, all at an affordable cost to fit out office space. Overall, office fit out cost  depends on a wide range of factors like the size of office space, facilities created, materials used, furniture sourced, and many more. Based on all these factors, the prices for office fit out and refurbishment may vary for different projects, however, this will give you a rough idea of ballpark office fit-out costs per square foot before starting your project. x This site uses cookies. Office Design Office Fit Out Office Refurbishment Office Furniture Office Experts Office Design Office Fit Out Office Refurbishment Office Furniture Office Experts What We Do Our Projects Who We Are GXI Group provide end–to–end office fit out, refurbishment & furniture solutions When we say end to end solutions, we mean it. We work with you from the outset. Right from securing office premises through to building regulations, fire safety, renovation, refurbishment, fit out and furniture. What makes us different is our passionate enthusiasm for every project, be it small offices to an entire building of serviced offices. GXI have proudly completed hundreds of office and commercial space fit out and refurbishment projects in London, Bristol, Southampton, Birmingham, Manchester, Aberdeen, Middlesex, Elstree, Milton Keynes, Leicester, Croydon, Gatwick, Harrow, Slough, Stevenage, Leeds, Wokingham, Watford, Borehamwood, Reading, High Wycombe, Kent. We have helped fit out, renovate, refurbish offices and commercial workspaces for several clients from diverse industries, right from banks, recruitment companies and accountants, through to cafes, hotels, solicitors & law firms, housing associations, educational institutions, investors and many more. The type of Office Refurbishment and Fit Out projects we have handled are small, medium and large offices, warehouses, universities,hotels, spas, entire block of serviced offices and more. How much does Office fit out cost in London, UK? Our strength is our Interior Designers and team of experts who have extensive experience in creating gorgeous offices & workspaces with highest service. They combine design, commercial, and technical knowledge to provide the best experience, all at an affordable cost to fit out office space. Overall, office fit out cost  depends on a wide range of factors like the size of office space, facilities created, materials used, furniture sourced, and many more. Based on all these factors, the prices for office fit out and refurbishment may vary for different projects, however, this will give you a rough idea of ballpark office fit-out costs per square foot before starting your project. If you’ve got a new office space as shell and core and need to do CAT A and CAT B, here’s a list of cost you should be looking at: 1) CAT A + CAT B While CAT A fit out focuses on the basics of office build including floor work, ceiling works, basic mechanical and electrical services, CAT B fit-out is the next step that completes the designing process. Here is the list of CAT A + CAT B fit-out costs: Cost Factors Cost Construction £20 - £60+ Mechanical £25 - £35+ Electrical Network Infrastructure Furniture £6 - £16+ 2)CAT B only CAT B only focuses on transforming the CAT A structure and giving it the final look. It includes works related to partition, finishes, design, furniture, etc. Here is the list of pricing for CAT B only: £12 - £25+ £6 - £10+ These are typical figures based on past projects. However, office fit-out costs per square foot  may vary based on several factors. The final price will be fixed based on many factors like base structure and HVAC requirements of your office building. Our Work Company Our Services Contact Us - Registered company name: GXI LTD | Company reg. no: 03274123 × Request a call back from the GXI team First Name* Company* Last Name* Phone* Work Email* Preferred time Loading Your message has been sent. Thank you! Send Loading  Your message has been sent. Thank you!     Send"}, {"url": "https://www.gxigroup.com/projects-ngage-recruitment/", "content": "Specialising in Fast-track End-to-end Office Fit Out and Refurbishments for Small & Medium Size Businesses / Ngage Recruitment This London office was our fourth office fit out project for nGage Recruitment. It came with its own challenge as we needed to accommodate three sister companies under the nGage umbrella. Being in the recruitment business. maximum meeting spaces were required. We created several pods, meeting rooms and break-out areas to facilitate formal and informal discussions while also making space for future expansion Their global presence made it easier to create themes for each meeting room. We created a subtle change in the feel from one room to the other by accenting one wall with a digital wall covering. Also to mention was the beautiful installation of the interactive black glass TV wall which not only allowed presentation on the screen, but also let you write on it. Alongside working with the existing Dali system, we introduced latest lighting technology in the key areas. Group Chief Operating Officer, nGage Recruitment Devonshire House 582 Honeypot Lane Stanmore, Harrow London, HA7 1JS London Office: GXI Group 2-7 Clerkenwell Green London EC1R 0DE Company number: 03274123 -   -   Registered company name: GXI LTD | Company reg. no: 03274123    / Ngage Recruitment      × * * * * * x This site uses cookies. London | Recruiting | 7,300 SQ FT Spacious Office Planning Modern Office Fit Out & Design Also to mention was the beautiful installation of the interactive black glass TV wall which not only allowed presentation on the screen, but also let you write on it. Alongside working with the existing Dali system, we introduced latest lighting technology in the key areas. “On every occasion I have found GXI to have produced a level of quality work that has been exactly what we were looking for. They have always been reliable, on time and on budget. Communication has always been excellent and their overall approach very professional.” Adam Herron Group Chief Operating Officer, nGage Recruitment Our Work Company Our Services Contact Us - Registered company name: GXI LTD | Company reg. no: 03274123 × Request a call back from the GXI team First Name* Company* Last Name* Phone* Work Email* Preferred time Loading Your message has been sent. Thank you! Send Loading  Your message has been sent. Thank you!     Send"}, {"url": "https://www.gxigroup.com/projects-gapuma/", "content": "Specialising in Fast-track End-to-end Office Fit Out and Refurbishments for Small & Medium Size Businesses / Gapuma This was our second project with Gapuma, a Queen’s Award winning exporter. It was a highly complex Shell & Core Office fit out project in a prestigious development on the banks of river Thames. We were required to achieve Very Good BREEAM rating. Because of the solid past experience and our client’s confidence in us, we were consulted about the space before finalising the deal. We were required to be considerate of easy communication between departments, generating movement throughout the space to prevent working in silos and allowing staff to make the most of stunning views over the Thames. Using a lot glass allowed transparency within the office and the walnut veneered doors catered to the sound levels maintaining the acoustics within each room. The contrast of carpet and furniture and the use of yellow colour made the space pop giving it a modern and contemporary feel. Group Director, Gapuma Devonshire House 582 Honeypot Lane Stanmore, Harrow London, HA7 1JS London Office: GXI Group 2-7 Clerkenwell Green London EC1R 0DE Company number: 03274123 -   -   Registered company name: GXI LTD | Company reg. no: 03274123    / Gapuma      × * * * * * x This site uses cookies. London | Exporter | 5,250 SQ FT Modern Office Fit Out Perfect Planning & Execution Using a lot glass allowed transparency within the office and the walnut veneered doors catered to the sound levels maintaining the acoustics within each room. The contrast of carpet and furniture and the use of yellow colour made the space pop giving it a modern and contemporary feel. “They are one of the most professional, knowledgeable and straightforward organisations I’ve dealt with. Communication was open and transparent from day one. They worked tirelessly with high levels of enthusiasm and always exceeded expectations. Their experience and knowledge in every aspect of the office refurbishment and beyond is very evident in how smoothly they operate.” Jack Bardakjian Group Director, Gapuma Our Work Company Our Services Contact Us - Registered company name: GXI LTD | Company reg. no: 03274123 × Request a call back from the GXI team First Name* Company* Last Name* Phone* Work Email* Preferred time Loading Your message has been sent. Thank you! Send Loading  Your message has been sent. Thank you!     Send"}, {"url": "https://www.gxigroup.com/projects-signature/", "content": "Specialising in Fast-track End-to-end Office Fit Out and Refurbishments for Small & Medium Size Businesses / Signature Signature Car Hire are a leading prestige and performance care hire company. They provide the finest luxury and supercars available on the market. Their fleet includes brands like Rolls Royve, Bentley, Ferrari and more. In this shell & core project, our key objective was to make sure that the extravagance of the car is reflected in the office and the showroom. The space was smartly planned to keep all of the ground floor for the showroom and waiting lounge, whereas the offices were on the mezzanine overlooking the showroom. The furniture was picked from our elite range to wow the clients and create that first impression. White being the colour of luxury and perfection was nicely balanced with grey and blue to reflect trust and confidence. A lot of glass was used to symbolise openness and provide a grand feel to the space. Showroom was purely white to make sure that the only thing the clients see are the cars. Brand colours were subtly incorporated within the space and the logo was smoothly blended to ensure association. The stylised furniture selected was from our elite range meticulously designed with attention to detail and finish. Devonshire House 582 Honeypot Lane Stanmore, Harrow London, HA7 1JS London Office: GXI Group 2-7 Clerkenwell Green London EC1R 0DE Company number: 03274123 -   -   Registered company name: GXI LTD | Company reg. no: 03274123    / Signature      × * * * * * x This site uses cookies. London | Prestige Car Hire | 10,000 SO FT First Class Luxury Fit Out Smart Space Planning The Perfect Makeover Our Work Company Our Services Contact Us - Registered company name: GXI LTD | Company reg. no: 03274123 × Request a call back from the GXI team First Name* Company* Last Name* Phone* Work Email* Preferred time Loading Your message has been sent. Thank you! Send Loading  Your message has been sent. Thank you!     Send"}, {"url": "https://www.gxigroup.com/projects-emafyl/", "content": "Specialising in Fast-track End-to-end Office Fit Out and Refurbishments for Small & Medium Size Businesses / Emafyl Emafyl are a Queen’s Award winning business who are into Property Management and are world leaders in picture frames and architectural moulding. They were relocating to North London in a perfectly located new office block. The brief was to transform their new shell & core space into a high end luxurious office which their staff and clients would love and the first thing anyone visiting would say is…WOW!!! The client wanted a hands-off turnkey solution and trusted GXI with the total end to end service. A luxurious office means different things to different people, so it was hard to define exact requirements. Our design team held detailed workshops with the client at GXI Interior Design Studio, studying their business, their design preference and overall look and aspirations from the new office. Interior Design, furniture and finishes were the three most critical aspects of this project to create a high end executive office environment. We consciously chose grey and brown (well light brown) colours which nicely sit with each other. Grey creating a sense of calm and composure and Brown evoking a sense of strength and reliability. The indulgent leather inset perfectly complemented the straights and the curves of the executive office desk and executive chair. If given a choice, we would rate these chairs the most comfortable executive chairs in the world. But then you need to sit on it to believe it. We found a perfect partner in this dapper looking lampshade adding to the plush set-up. The dual-tone concrete look carpet seamlessly complements the furniture adding modern to the classic lavishness. Another modern classic is the kitchen. The classic mosaic made from durable vinyl is the perfect sturdy match for the modern German kitchen. A masterpiece designed and crafted in Italy, this unique and luxurious executive desk is the creation of award winning designers Franco and Roberto Driusso. This piece of timeless luxury created a perfect setting for the CEO to be part of open plan seating, but still have his own space. This exclusive executive desk is finished with unglazed porcelain and leather inset to bring in natural elements into every day working. This boardroom comes fully loaded with all the technology and frills, nicely tucked away to let other elements do the talking since most of them have a story to tell. The reclaimed wood mosaic panel is made from ethically sourced roots of trees many years old where mother nature has left her marks making each block unique. Nicely balanced with sound absorbing acoustic panels with aw 0.30 – 0.95 rating. You could actually record music in this space. These authentic ergonomic chairs have hundreds of hours of research and testing behind them before they were lovingly manufactured in Italy and shipped with care to the UK. With the perfect lumbar support and ergonomic design, you can easily sit in these chairs for hours. The combination of leather and Rovere finish on this solid boardroom table creates the perfect platform and the lights above it provide the halo to this dream boardroom. Even the toilets are made to perfection with custom design. Our theme of Modern Classic is continued with copper & stone finish tiles and high end modern fixtures and fittings. We took a customised approach with LED lights and had them cut to our specifications to achieve the infinity lights design. The LED lights and flooring in the corridor complemented each other so well that you could say they are made for each other. The perfect pair. Luxury oozed out of every corner of this project and we are really proud of our team to achieve all this even with lockdown restrictions and challenges. And a special Thank You to the clients for being the perfect partners. Devonshire House 582 Honeypot Lane Stanmore, Harrow London, HA7 1JS London Office: GXI Group 2-7 Clerkenwell Green London EC1R 0DE Company number: 03274123 -   -   Registered company name: GXI LTD | Company reg. no: 03274123    / Emafyl      × * * * * * x This site uses cookies. London | Manufacturing & Property Management | 4,500 SQ FT A Luxurious Office Fit Out It's Unique Office Interior Design & Finishes Modern Classic Office Furniture The Showstopper An Ideal Boardroom Design To a T Our Work Company Our Services Contact Us - Registered company name: GXI LTD | Company reg. no: 03274123 × Request a call back from the GXI team First Name* Company* Last Name* Phone* Work Email* Preferred time Loading Your message has been sent. Thank you! Send Loading  Your message has been sent. Thank you!     Send"}, {"url": "https://www.gxigroup.com/blog/office-fit-out-and-refurbishment-costs-in-london", "content": "Specialising in Fast-track End-to-end Office Fit Out and Refurbishments for Small & Medium Size Businesses Your office is the central point where co-workers come together and forge a space of innovation and creativity. A well-structured office space produces positive impacts on the working pattern of the employees. It will help enhance the productivity of employees and thus contribute to the overall growth of your company. If you are deciding to set up a new office or redesign the existing building, you might need to get a closer look at different office fit-out and refurbishment services. A fully integrated office fit out will help you transform the interiors and working spaces to make it more suitable and welcoming to the staff and visitors. If you want to witness continuous growth and bring out the best level of performance in your company, creating an efficient office space plays a crucial role. The most practical option you can undertake is to hire experienced professionals from reliable companies to carry out the office fit-out and refurbishment process. GXI Group is one of the renowned companies with 25 years of expertise and experience fitting out and refurbishing offices and commercial spaces. The team of experts provide beautiful, modern and effective design suitable for your office. The team carries out the process within the stipulated time and budget-friendly rates. You can go through the detailed list of  before hiring the service. GXI Group's pillar of strength is its panel of creative interior designers and team of experts who have extensive experience in delivering excellent customer service. They combine design, commercial, and technical knowledge to provide the best experience, all at an affordable cost to fit out office space. Your office fit-out cost depends on a wide range of factors like the total office space, materials used, facilities created, furniture sourced, and more. Even though the prices may vary with different projects, you can get a general idea about the price range offered by the GXI Group before hiring the service. A detailed check of the office fit-out costs per square foot should be done before starting your project.  The fit-out cost for both CAT A and CAT B is given below: 1) CAT A + CAT B While CAT A fit-out focuses on the basics of office design including floor work, ceiling works, basic mechanical and electrical services, CAT B fit-out is the next step that completes the designing process. From Shell & Core, the next step is to take the space to CAT A. After CAT A fit-out is done, further designing and furniture will be done in the CAT B process.  2) CAT B only   CAT B only focuses on transforming the CAT A structure and giving it the final look. It includes works related to partition, finishes, design, furniture, etc. Here is the list of pricing for CAT B only: These are typical figures based on past projects. However, office fit-out costs per square foot may vary based on several factors. The final price will be fixed based on many factors like base structure and HVAC requirements of your office building. Factors affecting office fit-out costs To calculate the total expenditure of the fit-out works and make it within the budget-friendly plan, you need to analyse some correlated factors of the process.         If you feel like your office is outdated or you are having a hard time retaining staff or competing in market, you might need to give a thought to redecorating or refurbishing your office. While a fit-out is carried out more or less from scratch, refurbishments are performed by making alterations to your existing office space.  Therefore, it is necessary to formulate an office refurbishment cost model before starting the work. The price of office refurbishment works is not fixed; it may vary with the changing requirements of individual projects. You should have a detailed plan sorted out before calculating whether the total cost stands within your budget. The experts at the GXI group will help you create a thorough plan before initiating the office refurbishment process. You can check out the office refurbishment costs per square foot in the detailed planner provided by the GXI group.  You can opt for refurbishment if your office needs updating and new furniture that matches your style. The dilapidation works carried out by our experts depend on myriad factors. You can carry out a complete office refurbishment process that covers construction plans, furniture settings and dilapidation works within a reasonable price range. Here is the detailed list of office refurbishment costs in various domains: These are tentative prices per square foot based on previous projects. It can vary according to the specifications of each product. Factors affecting office refurbishment costs         If you are planning to set up a new office or renovate your existing office building, the first step is to find the best group of professionals who can help you with the end to end process. GXI Group is one of the most reputed office refurbishment, and office fit-out designers with 24 years of experience, renowned for its intelligent and efficient services done at reasonable prices. The team consists of a panel of workspace planners, interior designers, and architectural experts.  The expert fit-out build teams are run by the correlated working of electricians, plumbers, AC’s installers, IT & telecom partners, and experienced project managers. The team puts forward a transparent and honest approach by establishing a friendly attitude towards customers. The team takes into account the business services and requirements of the clients before deciding what is best for them. Work happens together as a team and employs the most beneficial methods to transform your workspace and boost your business growth. Devonshire House 582 Honeypot Lane Stanmore, Harrow London, HA7 1JS London Office: GXI Group 2-7 Clerkenwell Green London EC1R 0DE Company number: 03274123 -   -   Registered company name: GXI LTD | Company reg. no: 03274123    Construction £20  -  £60+ Mechanical £25  -  £35+ Electrical £25  -  £35+ Network Infrastructure £25  -  £35+ Furniture £6  -  £16+  2) CAT B only    Construction £12  -  £25+ Mechanical £6  -  £10+ Electrical £6  -  £10+ Network Infrastructure £6  -  £10+ Furniture £6  -  £16+ Construction £15  -  £45+ Dilapidation £10  -  £20+ Mechanical £20  -  £30+ Electrical £20  -  £30+ Network Infrastructure £20  -  £30+ Furniture £6  -  £16+ by by  by  by  by       × * * * * * The complexity of work Your total cost depends on whether you need simple decorative work for the office or develop a brand new architectural framework. If you choose the first option where your office space is modified and decorated by adding elements like designer furniture and new flooring, the fit-out costs will be less.For a complete makeover of your office building that includes the construction of new walls and doorways, the total costs will be a bit higher. Therefore, office fit-out costs depend on the complexity of the work involved. Size of officeThe size of your office building and the working area plays a crucial role when it comes to calculating the total fit-out costs. You should have a basic idea about the size of the office and the area allotted to each of the subsections and related rooms. It is a difficult decision to choose because it depends on several factors.You should take into consideration the needs and necessities of co-workers. You should also get a closer look at the type of office spaces owned by competitive companies and the different ways it affects the productivity of the company. Lastly, you need to select the best spacing options that suit your budget and convey your business model. Technical factors For boosting the efficiency of your office systems, it is necessary to incorporate a good ICT and AV system into your office. The use of technology and modern equipment can contribute a lot to the success of your company. The elements of technology will be used to enhance the office space arrangement and furniture selection process. The technical experts at GXI group are equipped to provide your office with the latest design and fit-out appropriate for the fast-paced future world. Timeline of work One of the main factors that can have a direct impact on your office refurbishment cost is the timeline you choose. If you want your office renovated within a short period, it will cost a bit more. Planning a shorter timeline for office refurbishment will help you manage the business without much interruption in the office working hours. Only after fixing the timeline can you calculate the total cost for your office refurbishment works. Type of designThe main factor affecting the office refurbishment costs is the type of design chosen, be it traditional designs or modern aesthetic works. Get in touch with us and our interior designers and space planners will guide you through the entire process. A traditional refurbishment process requires complete coverage of various factors like the preferred spacing, furniture requirements, design fees, and so on. Under the GXI Group umbrella, we have a partner company supplying beautiful and quality office furniture in London. Choice of furnitureChoosing the right furniture that fits the essence and goals of your office is a crucial decision, and it adds up to the total cost of refurbishment. You should take extra care while purchasing and arranging furniture in all specific rooms of the office. In case you feel that your current office interiors are not up to the mark, you should opt for a better range of furniture. A well-planned seating arrangement, lighting settings, and acoustic paneling will ultimately lead to a highly productive workspace. It will ensure a safe and secure working atmosphere for the employees, thereby creating a unique space to feature their creative abilities. x This site uses cookies. Office Fit Out And Refurbishment Costs In London Your office is the central point where co-workers come together and forge a space of innovation and creativity. A well-structured office space produces positive impacts on the working pattern of the employees. It will help enhance the productivity of employees and thus contribute to the overall growth of your company.If you are deciding to set up a new office or redesign the existing building, you might need to get a closer look at different office fit-out and refurbishment services. A fully integrated office fit out will help you transform the interiors and working spaces to make it more suitable and welcoming to the staff and visitors. If you want to witness continuous growth and bring out the best level of performance in your company, creating an efficient office space plays a crucial role.The most practical option you can undertake is to hire experienced professionals from reliable companies to carry out the office fit-out and refurbishment process. GXI Group is one of the renowned companies with 25 years of expertise and experience fitting out and refurbishing offices and commercial spaces. The team of experts provide beautiful, modern and effective design suitable for your office.The team carries out the process within the stipulated time and budget-friendly rates. You can go through the detailed list of  before hiring the service.Office fit-out costsGXI Group's pillar of strength is its panel of creative interior designers and team of experts who have extensive experience in delivering excellent customer service. They combine design, commercial, and technical knowledge to provide the best experience, all at an affordable cost to fit out office space.Your office fit-out cost depends on a wide range of factors like the total office space, materials used, facilities created, furniture sourced, and more. Even though the prices may vary with different projects, you can get a general idea about the price range offered by the GXI Group before hiring the service. A detailed check of the office fit-out costs per square foot should be done before starting your project.The fit-out cost for both CAT A and CAT B is given below:1) CAT A + CAT BWhile CAT A fit-out focuses on the basics of office design including floor work, ceiling works, basic mechanical and electrical services, CAT B fit-out is the next step that completes the designing process. From Shell & Core, the next step is to take the space to CAT A. After CAT A fit-out is done, further designing and furniture will be done in the CAT B process.Cost FactorsCostConstruction£20  -  £60+Mechanical£25  -  £35+Electrical£25  -  £35+Network Infrastructure£25  -  £35+Furniture£6  -  £16+2) CAT B only CAT B only focuses on transforming the CAT A structure and giving it the final look. It includes works related to partition, finishes, design, furniture, etc. Here is the list of pricing for CAT B only:Cost FactorsCostConstruction£12  -  £25+Mechanical£6  -  £10+Electrical£6  -  £10+Network Infrastructure£6  -  £10+Furniture£6  -  £16+These are typical figures based on past projects. However, office fit-out costs per square foot may vary based on several factors. The final price will be fixed based on many factors like base structure and HVAC requirements of your office building.Factors affecting office fit-out costsTo calculate the total expenditure of the fit-out works and make it within the budget-friendly plan, you need to analyse some correlated factors of the process.The complexity of work Your total cost depends on whether you need simple decorative work for the office or develop a brand new architectural framework. If you choose the first option where your office space is modified and decorated by adding elements like designer furniture and new flooring, the fit-out costs will be less.For a complete makeover of your office building that includes the construction of new walls and doorways, the total costs will be a bit higher. Therefore, office fit-out costs depend on the complexity of the work involved.Size of officeThe size of your office building and the working area plays a crucial role when it comes to calculating the total fit-out costs. You should have a basic idea about the size of the office and the area allotted to each of the subsections and related rooms. It is a difficult decision to choose because it depends on several factors.You should take into consideration the needs and necessities of co-workers. You should also get a closer look at the type of office spaces owned by competitive companies and the different ways it affects the productivity of the company. Lastly, you need to select the best spacing options that suit your budget and convey your business model.Technical factors For boosting the efficiency of your office systems, it is necessary to incorporate a good ICT and AV system into your office. The use of technology and modern equipment can contribute a lot to the success of your company. The elements of technology will be used to enhance the office space arrangement and furniture selection process. The technical experts at GXI group are equipped to provide your office with the latest design and fit-out appropriate for the fast-paced future world.Office refurbishment costsIf you feel like your office is outdated or you are having a hard time retaining staff or competing in market, you might need to give a thought to redecorating or refurbishing your office. While a fit-out is carried out more or less from scratch, refurbishments are performed by making alterations to your existing office space. Therefore, it is necessary to formulate an office refurbishment cost model before starting the work. The price of office refurbishment works is not fixed; it may vary with the changing requirements of individual projects. You should have a detailed plan sorted out before calculating whether the total cost stands within your budget.The experts at the GXI group will help you create a thorough plan before initiating the office refurbishment process. You can check out the office refurbishment costs per square foot in the detailed planner provided by the GXI group.You can opt for refurbishment if your office needs updating and new furniture that matches your style. The dilapidation works carried out by our experts depend on myriad factors. You can carry out a complete office refurbishment process that covers construction plans, furniture settings and dilapidation works within a reasonable price range.Here is the detailed list of office refurbishment costs in various domains:Cost FactorsCostConstruction£15  -  £45+Dilapidation£10  -  £20+Mechanical£20  -  £30+Electrical£20  -  £30+Network Infrastructure£20  -  £30+Furniture£6  -  £16+These are tentative prices per square foot based on previous projects. It can vary according to the specifications of each product.Factors affecting office refurbishment costsTimeline of work One of the main factors that can have a direct impact on your office refurbishment cost is the timeline you choose. If you want your office renovated within a short period, it will cost a bit more. Planning a shorter timeline for office refurbishment will help you manage the business without much interruption in the office working hours. Only after fixing the timeline can you calculate the total cost for your office refurbishment works.Type of designThe main factor affecting the office refurbishment costs is the type of design chosen, be it traditional designs or modern aesthetic works. Get in touch with us and our interior designers and space planners will guide you through the entire process. A traditional refurbishment process requires complete coverage of various factors like the preferred spacing, furniture requirements, design fees, and so on. Under the GXI Group umbrella, we have a partner company supplying beautiful and quality office furniture in London.Choice of furnitureChoosing the right furniture that fits the essence and goals of your office is a crucial decision, and it adds up to the total cost of refurbishment. You should take extra care while purchasing and arranging furniture in all specific rooms of the office. In case you feel that your current office interiors are not up to the mark, you should opt for a better range of furniture. A well-planned seating arrangement, lighting settings, and acoustic paneling will ultimately lead to a highly productive workspace. It will ensure a safe and secure working atmosphere for the employees, thereby creating a unique space to feature their creative abilities.Why choose the GXI group?If you are planning to set up a new office or renovate your existing office building, the first step is to find the best group of professionals who can help you with the end to end process. GXI Group is one of the most reputed office refurbishment, and office fit-out designers with 24 years of experience, renowned for its intelligent and efficient services done at reasonable prices. The team consists of a panel of workspace planners, interior designers, and architectural experts. The expert fit-out build teams are run by the correlated working of electricians, plumbers, AC’s installers, IT & telecom partners, and experienced project managers. The team puts forward a transparent and honest approach by establishing a friendly attitude towards customers. The team takes into account the business services and requirements of the clients before deciding what is best for them. Work happens together as a team and employs the most beneficial methods to transform your workspace and boost your business growth. by / Related Posts Our Work Company Our Services Contact Us - Registered company name: GXI LTD | Company reg. no: 03274123 × Request a call back from the GXI team First Name* Company* Last Name* Phone* Work Email* Preferred time Loading Your message has been sent. Thank you! Send Loading  Your message has been sent. Thank you!     Send"}, {"url": "https://www.gxigroup.com/blog/what-to-consider-when-thinking-about-it-telecoms-when-moving-offices", "content": ""}, {"url": "https://www.gxigroup.com/category/it-infrastructure/", "content": "Specialising in Fast-track End-to-end Office Fit Out and Refurbishments for Small & Medium Size Businesses Devonshire House 582 Honeypot Lane Stanmore, Harrow London, HA7 1JS London Office: GXI Group 2-7 Clerkenwell Green London EC1R 0DE Company number: 03274123 -   -   Registered company name: GXI LTD | Company reg. no: 03274123         × * * * * * x This site uses cookies. IT infrastructure Our Work Company Our Services Contact Us - Registered company name: GXI LTD | Company reg. no: 03274123 × Request a call back from the GXI team First Name* Company* Last Name* Phone* Work Email* Preferred time Loading Your message has been sent. Thank you! Send Loading  Your message has been sent. Thank you!     Send"}, {"url": "https://www.gxigroup.com/blog/value-of-good-property-consultants", "content": "Specialising in Fast-track End-to-end Office Fit Out and Refurbishments for Small & Medium Size Businesses When it comes to leasing or purchasing commercial property, the role of a property solicitor is paramount. Not only do they provide legal advice and assistance, but they also ensure that the transaction is completed smoothly and that the rights of all parties are protected. In this article, we’ll take a closer look at the key role and benefits of property solicitors in commercial property transactions, and why it’s so important to have one working on your side. One of the primary roles of property solicitors is to transaction process, from the initial offer and negotiation of terms, to the drafting and execution of the lease or purchase agreement. A property solicitor will ensure that the lease or purchase agreement complies with all relevant laws and regulations, and will advise on any potential legal issues or risks that may arise during the transaction. Having a property solicitor in place helps ensure that your interests and rights are protected, and that your commercial property transaction proceeds as smoothly as possible. Property solicitors also play a crucial role in due diligence, which is the process of reviewing and evaluating the various aspects of a property to identify any issues or risks associated with the property. This includes reviewing and commenting on the title, planning, and environmental searches. They will also provide guidance and advice on how to mitigate these issues, and will ensure that the client’s rights and interests are protected throughout the process. With the help of a property solicitor, you can be confident that your commercial property transaction will be based on the best information available, minimizing any potential risks and maximizing the chances of success. In addition to legal advice and due diligence, property solicitors also provide transactional support. This includes reviewing, drafting, and negotiating the legal documents involved in the transaction, and coordinating the completion process and managing the exchange of contracts. Throughout the transaction, property solicitors will work to ensure that all parties’ rights and obligations are protected and upheld, helping to ensure a smooth, successful outcome for all parties involved. Devonshire House 582 Honeypot Lane Stanmore, Harrow London, HA7 1JS London Office: GXI Group 2-7 Clerkenwell Green London EC1R 0DE Company number: 03274123 -   -   Registered company name: GXI LTD | Company reg. no: 03274123    by by  by  by  by       × * * * * * x This site uses cookies. Value of good property consultants When it comes to leasing or purchasing commercial property, the role of a property solicitor is paramount. Not only do they provide legal advice and assistance, but they also ensure that the transaction is completed smoothly and that the rights of all parties are protected. In this article, we’ll take a closer look at the key role and benefits of property solicitors in commercial property transactions, and why it’s so important to have one working on your side.1. Legal Advice and Assistance:One of the primary roles of property solicitors is to transaction process, from the initial offer and negotiation of terms, to the drafting and execution of the lease or purchase agreement. A property solicitor will ensure that the lease or purchase agreement complies with all relevant laws and regulations, and will advise on any potential legal issues or risks that may arise during the transaction. Having a property solicitor in place helps ensure that your interests and rights are protected, and that your commercial property transaction proceeds as smoothly as possible.2. Due Diligence:Property solicitors also play a crucial role in due diligence, which is the process of reviewing and evaluating the various aspects of a property to identify any issues or risks associated with the property. This includes reviewing and commenting on the title, planning, and environmental searches. They will also provide guidance and advice on how to mitigate these issues, and will ensure that the client’s rights and interests are protected throughout the process. With the help of a property solicitor, you can be confident that your commercial property transaction will be based on the best information available, minimizing any potential risks and maximizing the chances of success.3. Transactional Support:In addition to legal advice and due diligence, property solicitors also provide transactional support. This includes reviewing, drafting, and negotiating the legal documents involved in the transaction, and coordinating the completion process and managing the exchange of contracts. Throughout the transaction, property solicitors will work to ensure that all parties’ rights and obligations are protected and upheld, helping to ensure a smooth, successful outcome for all parties involved. by / Related Posts Our Work Company Our Services Contact Us - Registered company name: GXI LTD | Company reg. no: 03274123 × Request a call back from the GXI team First Name* Company* Last Name* Phone* Work Email* Preferred time Loading Your message has been sent. Thank you! Send Loading  Your message has been sent. Thank you!     Send"}, {"url": "https://www.gxigroup.com/category/office-tips/", "content": "Specialising in Fast-track End-to-end Office Fit Out and Refurbishments for Small & Medium Size Businesses Devonshire House 582 Honeypot Lane Stanmore, Harrow London, HA7 1JS London Office: GXI Group 2-7 Clerkenwell Green London EC1R 0DE Company number: 03274123 -   -   Registered company name: GXI LTD | Company reg. no: 03274123         × * * * * * x This site uses cookies. Office Tips Our Work Company Our Services Contact Us - Registered company name: GXI LTD | Company reg. no: 03274123 × Request a call back from the GXI team First Name* Company* Last Name* Phone* Work Email* Preferred time Loading Your message has been sent. Thank you! Send Loading  Your message has been sent. Thank you!     Send"}, {"url": "https://www.gxigroup.com/blog/benefit-of-using-a-property-consultant", "content": "Specialising in Fast-track End-to-end Office Fit Out and Refurbishments for Small & Medium Size Businesses When it comes to moving office, cost is often the top concern for businesses. Rent, service charges, insurance, and taxes can all add up, making it hard to evaluate which property is the most cost-effective option for your business. However, what many businesses don’t realize is that by using the right property consultant, they can actually end up paying less for their office space in the long term. In this article, we will cover the key ways in which a property consultant can help businesses save money on their office space, including negotiating the best deal, understanding hidden costs, and managing the move. Before looking for a new office space, it’s important to clearly. This includes determining the size of the space required, the layout, amenities, and any specific requirements such as accessibility or parking. By doing this analysis, a property consultant can help you to find the right location, in the right area, that meets all your needs, and that can lead to cost savings. Once your requirements are clear, the property consultant will search for properties that meet your needs and budget. They will schedule viewings of the selected properties, and they will take you through the property, answering any questions you may have and providing you with relevant information about the building and the location. They will also be able to provide you with comparables of similar properties, so you can make an informed decision on the price and the property. With the help of a property consultant, you can be sure that you are seeing the best options available and that can lead to cost savings in the long run. After viewing the properties, the property consultant will provide a detailed cost analysis on the shortlisted options. This will allow you to understand the costs associated with each property and make a more informed decision on which property is the most cost-effective option for your business. This is a crucial step in the process and can lead to. Devonshire House 582 Honeypot Lane Stanmore, Harrow London, HA7 1JS London Office: GXI Group 2-7 Clerkenwell Green London EC1R 0DE Company number: 03274123 -   -   Registered company name: GXI LTD | Company reg. no: 03274123    by by  by  by  by       × * * * * * x This site uses cookies. Benefit of using a property consultant Introduction:When it comes to moving office, cost is often the top concern for businesses. Rent, service charges, insurance, and taxes can all add up, making it hard to evaluate which property is the most cost-effective option for your business. However, what many businesses don’t realize is that by using the right property consultant, they can actually end up paying less for their office space in the long term. In this article, we will cover the key ways in which a property consultant can help businesses save money on their office space, including negotiating the best deal, understanding hidden costs, and managing the move.1. Analyze & Define your Office Space Requirements:Before looking for a new office space, it’s important to clearly. This includes determining the size of the space required, the layout, amenities, and any specific requirements such as accessibility or parking. By doing this analysis, a property consultant can help you to find the right location, in the right area, that meets all your needs, and that can lead to cost savings.2. Property Search & Viewings:Once your requirements are clear, the property consultant will search for properties that meet your needs and budget. They will schedule viewings of the selected properties, and they will take you through the property, answering any questions you may have and providing you with relevant information about the building and the location. They will also be able to provide you with comparables of similar properties, so you can make an informed decision on the price and the property. With the help of a property consultant, you can be sure that you are seeing the best options available and that can lead to cost savings in the long run.3. Detailed Cost Analysis on Short List:After viewing the properties, the property consultant will provide a detailed cost analysis on the shortlisted options. This will allow you to understand the costs associated with each property and make a more informed decision on which property is the most cost-effective option for your business. This is a crucial step in the process and can lead to. by / Related Posts Our Work Company Our Services Contact Us - Registered company name: GXI LTD | Company reg. no: 03274123 × Request a call back from the GXI team First Name* Company* Last Name* Phone* Work Email* Preferred time Loading Your message has been sent. Thank you! Send Loading  Your message has been sent. Thank you!     Send"}, {"url": "https://www.gxigroup.com/blog/essential-information-for-an-office-move", "content": "Specialising in Fast-track End-to-end Office Fit Out and Refurbishments for Small & Medium Size Businesses , it can also be a smooth and successful transition for your business. In this guide, we will cover essential tips for planning an office move, including creating a detailed plan, selecting the right moving company, preparing your office space, managing the move itself, and settling into the new space. By following these tips, businesses can ensure that their office move is as efficient and stress-free as possible. The first step in planning an office move is to create a detailed plan. This should include a timeline, a budget, and a list of tasks that need to be completed. The plan should also include a detailed inventory of all the office equipment and furniture, so that nothing gets left behind or lost in the move. Additionally, it’s important to notify all employees, suppliers, customers, and stakeholders of the move, so that everyone is on the same page and can plan accordingly. Choosing the right moving company is crucial when planning an office move. When selecting a moving company, businesses should consider the company’s reputation, experience, and the level of service they provide. It’s also a good idea to get multiple quotes and compare prices, so that you can make an informed decision. Additionally, businesses should also ask the moving company about their insurance coverage and ask to see copies of their certifications. Once the moving company has been chosen, it’s time to start. This includes packing up all the , so that it’s ready to be moved. It’s also a good idea to label all the boxes with the contents and the room they need to go to, so that the moving process is as smooth as possible. Additionally, businesses should also arrange for the disconnection of all services, such as internet, phone, and electricity, so that they can be reconnected at the new location. Devonshire House 582 Honeypot Lane Stanmore, Harrow London, HA7 1JS London Office: GXI Group 2-7 Clerkenwell Green London EC1R 0DE Company number: 03274123 -   -   Registered company name: GXI LTD | Company reg. no: 03274123    by by  by  by  by       × * * * * * x This site uses cookies. ESSENTIAL INFORMATION FOR AN OFFICE MOVE Introduction:, it can also be a smooth and successful transition for your business. In this guide, we will cover essential tips for planning an office move, including creating a detailed plan, selecting the right moving company, preparing your office space, managing the move itself, and settling into the new space. By following these tips, businesses can ensure that their office move is as efficient and stress-free as possible.1. Creating a detailed plan:The first step in planning an office move is to create a detailed plan. This should include a timeline, a budget, and a list of tasks that need to be completed. The plan should also include a detailed inventory of all the office equipment and furniture, so that nothing gets left behind or lost in the move. Additionally, it’s important to notify all employees, suppliers, customers, and stakeholders of the move, so that everyone is on the same page and can plan accordingly.2. Choosing the right moving company:Choosing the right moving company is crucial when planning an office move. When selecting a moving company, businesses should consider the company’s reputation, experience, and the level of service they provide. It’s also a good idea to get multiple quotes and compare prices, so that you can make an informed decision. Additionally, businesses should also ask the moving company about their insurance coverage and ask to see copies of their certifications.3. Preparing the office space:Once the moving company has been chosen, it’s time to start. This includes packing up all the , so that it’s ready to be moved. It’s also a good idea to label all the boxes with the contents and the room they need to go to, so that the moving process is as smooth as possible. Additionally, businesses should also arrange for the disconnection of all services, such as internet, phone, and electricity, so that they can be reconnected at the new location. by / Related Posts Our Work Company Our Services Contact Us - Registered company name: GXI LTD | Company reg. no: 03274123 × Request a call back from the GXI team First Name* Company* Last Name* Phone* Work Email* Preferred time Loading Your message has been sent. Thank you! Send Loading  Your message has been sent. Thank you!     Send"}, {"url": "https://www.gxigroup.com/category/office-refurbishment/", "content": ""}, {"url": "https://www.gxigroup.com/knowledge/", "content": ""}, {"url": "https://www.gxigroup.com/projects-comparex/", "content": ""}, {"url": "https://www.gxigroup.com/project-charter-house/", "content": ""}, {"url": "https://www.gxigroup.com/projects-paradox/", "content": ""}, {"url": "https://www.gxigroup.com/projects-ccp/", "content": "Specialising in Fast-track End-to-end Office Fit Out and Refurbishments for Small & Medium Size Businesses / Creative Car Park Creative Car Park are one of the leading UK Car Park Management companies. Their office move marked the next chapter in the company’s progression. They moved into an office building in Finchley, London occupying all the floors (ground plus three) with an office area of 12,000 sq. ft. The client entrusted GXI with office space planning, refurbishment and fit out and wanted the overall look to be fresh and tasteful, and each floor to be different, but the same. We held a few collaborative workshops with the client at GXI Design Studio where we presented our vision for the space and collectively brought the dream office to life. The entire office was perfectly planned to accommodate different departments on different floors, ample meeting rooms, Senior Management offices, an entire floor dedicated to break-out area, kitchen, and comfy seating. Intelligent space planning also allowed scope for future expansion. The gorgeous and sturdy office furniture was sourced from Italy and perfectly matched the overall look. The choice of fresh and vibrant carpet with structured linear design added to the energy of the space. All the floors used the same carpet but with different colour insets to make each floor distinctive. We created a beautiful office and had a lot of fun at the same time. This wouldn’t have been possible without the super amazing client. Devonshire House 582 Honeypot Lane Stanmore, Harrow London, HA7 1JS London Office: GXI Group 2-7 Clerkenwell Green London EC1R 0DE Company number: 03274123 -   -   Registered company name: GXI LTD | Company reg. no: 03274123    / Creative Car Park      × * * * * * x This site uses cookies. London | Car Park Management | 12,000 SQ FT Office Fit Out Brief Our Synergy Born in Italia Our Work Company Our Services Contact Us - Registered company name: GXI LTD | Company reg. no: 03274123 × Request a call back from the GXI team First Name* Company* Last Name* Phone* Work Email* Preferred time Loading Your message has been sent. Thank you! Send Loading  Your message has been sent. Thank you!     Send"}, {"url": "https://www.gxigroup.com/faq/", "content": "Specialising in Fast-track End-to-end Office Fit Out and Refurbishments for Small & Medium Size Businesses The extent of depends on the needs of a client. Occasionally, an office refurbishment may involve installing decorative elements such as wall decor, making , making mechanical and , as well as and . Some of the reasons for refurbishing an office include: There are plenty of design ideas available on social platforms such as Pinterest. Similarly, you can consult with a refurbishment consultant like GXI Group or check out furniture that would go well with your plan. Office fit-outs and refurbishments are conducted by contractors, specialists, and the relevant tradesmen. Some contractors and design companies specialise in different aspects of renovation and refurbishment, while others engage in all features of a refurbishment. Design and build companies such as the GXI group engage in specialised as well as general refurbishment. The right contractor listens to your needs and issues suggestions before embarking on the actual refurbishment project. There are various companies specialising in the sale and supply of office furniture. For the best results, check out reputable sources such as Auraa Design for some of the best office furniture. You can also check out their catalogue for ideas. When making a refurbishment plan it is important to first address the previous office’s shortcomings. However, if you want to have a fresh start, here are some of the areas you might need to check out for: This depends entirely on the size of the project. However, in ordinary circumstances, the design, quoting, and approval phase takes about 2 weeks. Similarly, ordinary fit outs may take anywhere between 3 to 8 weeks while partitioning and final finish may take longer or lesser time. If you opt to work with a refurbishment company for the whole process, choosing them will be the first step. Companies such as the GXI group offer  whereby, after getting to know the business and its requirements, they present  exploring the different options. This ensures that the  meets your needs and requirements functionally and aesthetically. After that, you are provided with a comprehensive cost assessment before signing off the work. This varies depending on what you want to be done. Having everything in one refurbishment package can significantly save you, time, money, and resources. If you chose to get everything from one contractor, you could also negotiate on the overall price. As with all building works, there can be some unexpected costs. These costs may arise due to a variety of factors such as a change in design or change in requirements. Furthermore, cost changes can also occur when a structural fault is identified during the undertaking of the project. However, in all cases, a good contractor/ refurbishment company like the GXI group will keep you updated on what is happening throughout the process. Yes, this can be done. The contractor can bring in the relevant qualified surveyors and contract management and administration teams for an in-depth analysis. These teams can then give accurate and concise findings, recommendations, as well as quotations. No. Asking for 100% upfront payment is not an industry standard. Payment terms should be arranged to suit both project participants (contractor and customer). On many occasions, a good contractor will not ask for 100% upfront payment. Often, all you need to do is send an inquiry to your refurbishment company of choice. After that, the company will follow up by sending a representative, who will assess the project and later on give detailed feedback. No project is the same as the other. Therefore the price of each project reflects the specific demands of the project. In order to get the , the contractor may conduct a feasibility study, reports, or undergo remedial costs as per the guidance of the architects, developers and contractors. However, compared to developing a property, refurbishing it may be much cheaper in the long run. Factors influencing the price of the project are, scope and size of the project, whether it will be an empty space or will be occupied during works, existing condition of the office space, whether all the refurbishment work needs to be conducted in one go or is it a start – stop – start kind of a project. Yes, there are regulations depending on the size and extent of the refurbishments. These laws mainly revolve around risk assessment to workers and the office users during and after the refurbishments. For more guidelines and regulations, you can check out the The answer is yes. You will need to seek the landlord’s permission before signing off the works or having the work commence. Typically, it is wise to consult with the landlord when the floor layout is approved. This way, the landlord knows about the overall changes to be put in place. In some cases,  may require building regulation. In most cases, if the emergency door where people would run through is affected, then the building regulation approval is required. Your contractor may advise you accordingly. Similarly, on several occasions, the contractor may volunteer to deal with the building regulation application. The key to identifying the right company is in the company’s track record. Companies that have good ratings and reviews often tend to do their best to retain a positive outlook. On many occasions, a good refurbishment company will listen to your needs, understand your needs and communicate. You should feel free to ask your company of choice questions on costs and potential risks. Similarly, you can review different companies before settling on one. Professional companies can handle refurbishments in any weather. However, when working on the building exteriors, some weather conditions may be unfavourable. For clarification on this, consult your refurbishment company. Yes. Nearly all refurbishment companies would be glad to do small, medium, and large scale . There is no such thing as “too small” projects for many companies. If you want to do a customised  according to your specific taste and instructions, you can. However, you may need to negotiate with the contractor prior, and have all directions scrutinised for practicality. Before exploring the options available, it is wise to have a  checklist. A checklist helps one to focus on the main reasons for refurbishment. For instance, if the size or height of the desks prompted the change, then that should be made a priority. Various office checklist templates are available on the internet and are worth a try. Alternatively, many refurbishment companies can offer a checklist which might help in identifying the main point of focus. Yes. Some refurbishment companies can build extensions, but you need to have the relevant planning and building permissions in place. Similarly, you may need to consult with the company before making the contract. It is recommended that you get an architect before altering a property structure. However, after the architect gives guidance on how to go about it, he or she doesn’t need to continue working on the project. On the same note, while some refurbishment companies are capable of working with private architects, others might not be willing to do the same. An excellent refurbishment company will most likely send a representative to assess the site to understand the task at hand. While some companies may charge for such consultations, other companies offer no-obligation site visits in order to provide the solution necessary. Reputable refurbishment companies like the  often work with health and safety partners who assess the risk and issue of comprehensive risk assessments and methodologies for the entire work. Before choosing your contractor or refurbishment company, you should check its policy on this as it might vary from company to company. In most cases, professional companies will provide specialist property reports that highlight internal and external inspection findings, recommendations, quotations, and marked up work plans. If you might still need to be taken through the refurbishment process step by step, you can liaise with the designated refurbishing teams. Whether the refurbishment disrupts the day to day business activities depends on the contractor and the level of renovation. A contractor can work in different sections while employees work on others and then have the employees move to the renovated space. Similarly, a contractor can operate during out-of-hours to minimise the disruption of the business activities. Most contractors will take care of the waste from start to finish. However, this might not be the case in all circumstances. Before making the refurbishment contract, the issue can be added in the checklist of issues that need to be raised. Office refurbishment involves improving an existing working space. However, a fit-out involves developing a new space that is not occupied. On certain occasions, the term ‘office fit-out’ is used to describe the process of making interior spaces ready for occupation. is the stylish division of office space to create sub-offices and other office sections such as kitchens, breakout areas, boardrooms and meeting rooms. Office partitioning helps to plan and divide an open floor plan space for various functions. This depends on the arrangements made with the landlord. However, refurbishment companies can help in dismounting of the existing partitions and remounting them. Yes, they can. But this is also subject to the company which you choose to do the partitioning. Often, the glass partitioning also comes with an aluminium partitioning framework that can have a finish of any colour. The finish is made using paint, wall coverings, vinyl, or suitable films that have company colours and logos. Yes. Refurbishments may involve combining rooms. However, this may necessitate the consultation of an architect if a wall is to be knocked down. In addition, the building regulation authority may need to be notified as well. Devonshire House 582 Honeypot Lane Stanmore, Harrow London, HA7 1JS London Office: GXI Group 2-7 Clerkenwell Green London EC1R 0DE Company number: 03274123 -   -   Registered company name: GXI LTD | Company reg. no: 03274123         × * * * * * What do office refurbishments involve? Why conduct an office Refurbishment? Great first impression – Every business needs to make a great first impression when customers or clients come knocking. An office refurbishment can be aimed at improving workplace aesthetics. Improved communications – Due to technological advancements, offices need to accommodate current technologies for increased efficiency. Enhancing employee work experience – Modern business-space trends are aimed at making employees more comfortable for maximum productivity. An office may be refurbished to create a favourable working environment. Biophilic design- In the modern-day world, customers seek to conduct business with environment-conscious companies. As a continuing trend, business offices are being refurbished to give the office a natural environment texture. Great first impression – Every business needs to make a great first impression when customers or clients come knocking. An office refurbishment can be aimed at improving workplace aesthetics. Improved communications – Due to technological advancements, offices need to accommodate current technologies for increased efficiency. Enhancing employee work experience – Modern business-space trends are aimed at making employees more comfortable for maximum productivity. An office may be refurbished to create a favourable working environment. Biophilic design- In the modern-day world, customers seek to conduct business with environment-conscious companies. As a continuing trend, business offices are being refurbished to give the office a natural environment texture. Where can I get office refurbishment ideas? Who carries out an office refurbishment? Where do I source the furniture? I want to make my office layout plan. What areas should I prioritise? The reception area Visitor’s waiting area Open plan area of various departments The manager’s office Meeting rooms Breakout areas and informal meeting zones Printing hubs Conference facilities Refreshment points Building service area Waste and recycling points The reception area Visitor’s waiting area Open plan area of various departments The manager’s office Meeting rooms Breakout areas and informal meeting zones Printing hubs Conference facilities Refreshment points Building service area Waste and recycling points How long does a refurbishment project take from start to finish? Where do I start in case I need a new fit-out or refurbishment? How much does an office refurbishment cost? Can there be any unexpected costs? Can I ask for accurate project duration and cost estimations? When working with a refurbishment company, do I have to pay for everything upfront? How do I go about getting a quotation for my work? What are the most common factors influencing the price of a refurbishment? Are there building regulations for office refurbishments in the UK? Do we need the landlord’s permission to do office refurbishments? Will the office refurbishment project require building regulation approval? How do I choose an office refurbishment company? Which is the best season to start refurbishments on a property? Our offices need small scale refurbishments such as door maintenance and carpeting, are there refurbishment companies that do that? Can I hire a refurbishment company for a bespoke renovation project? Do I need to have an office fit-out checklist? Can a refurbishment company build an extension to the building? Can I hire an architect before altering the property structure? Can the architect go on to work with the refurbishment company I chose later on? What sort of information do I need to offer for my project? What about health and safety during the refurbishments, who will manage that? Can I ask for property reports during the refurbishment process? Can an office be refurbished without disrupting the day to day business activities? Who is supposed to take care of the repair waste? What is the difference between office refurbishment and an office fit-out? What is an office partitioning? What happens when we leave the premises and need to take down our partitioning? Can our company colours be used to create glass partitioning? During a refurbishment, can two rooms be combined to become a single room? x This site uses cookies. FAQ Understanding Aspects of Refurbishment The Planning Phase Project Pricing Refurbishments Regulations Working with a Refurbishment Company Our Work Company Our Services Contact Us - Registered company name: GXI LTD | Company reg. no: 03274123 × Request a call back from the GXI team First Name* Company* Last Name* Phone* Work Email* Preferred time Loading Your message has been sent. Thank you! Send Loading  Your message has been sent. Thank you!     Send"}, {"url": "https://www.gxigroup.com/corporate-responsibility/", "content": "Specialising in Fast-track End-to-end Office Fit Out and Refurbishments for Small & Medium Size Businesses Here at the GXI Group, our goal is to deliver you an office space that you can be proud of. From being the base for your staff to hosting meetings with potential clients, your office space is a crucial part of your business. We believe it’s our responsibility to work with clients to create working environments that are efficient, tailored to them, and can be completed to the scope set out, such as deadlines and budgets. We consider everything from the big picture, such as the overall layout of your office, right down to those tiny details that give you space a personal touch. With our expert team on hand, we guarantee that your London office refurbishment will reflect your business and both the challenges and opportunities the space offers. From taking advantage of natural light entering your office building to minimising distracting sounds from outside, we’ll help you create the most efficient office space possible. If corporate responsibility is an important part of your business ethos, we can help build it into your office space too. From improving energy efficiency to using recycled materials where possible, our expert interior designers can build your corporate responsibility goals into your plans and design. By working with clients on an individual basis, we really understand what’s important to you when it comes to your office and the way you operate. If sustainability is crucial, we’re here to help you achieve meet the aims you’ve set out. Devonshire House 582 Honeypot Lane Stanmore, Harrow London, HA7 1JS London Office: GXI Group 2-7 Clerkenwell Green London EC1R 0DE Company number: 03274123 -   -   Registered company name: GXI LTD | Company reg. no: 03274123         × * * * * * x This site uses cookies. Corporate Responsibility Here at the GXI Group, our goal is to deliver you an office space that you can be proud of. From being the base for your staff to hosting meetings with potential clients, your office space is a crucial part of your business. We believe it’s our responsibility to work with clients to create working environments that are efficient, tailored to them, and can be completed to the scope set out, such as deadlines and budgets. We consider everything from the big picture, such as the overall layout of your office, right down to those tiny details that give you space a personal touch. With our expert team on hand, we guarantee that your London office refurbishment will reflect your business and both the challenges and opportunities the space offers. From taking advantage of natural light entering your office building to minimising distracting sounds from outside, we’ll help you create the most efficient office space possible. Matching your corporate responsibility goals If corporate responsibility is an important part of your business ethos, we can help build it into your office space too. From improving energy efficiency to using recycled materials where possible, our expert interior designers can build your corporate responsibility goals into your plans and design. Our Work Company Our Services Contact Us - Registered company name: GXI LTD | Company reg. no: 03274123 × Request a call back from the GXI team First Name* Company* Last Name* Phone* Work Email* Preferred time Loading Your message has been sent. Thank you! Send Loading  Your message has been sent. Thank you!     Send"}, {"url": "https://www.gxigroup.com/privacy-policy/", "content": "Specialising in Fast-track End-to-end Office Fit Out and Refurbishments for Small & Medium Size Businesses At GXI Limited, we make every effort to ensure we protect your personal information. This site, www.gxigroup.com (the “Website”) is owned and operated by GXI Ltd. In this Privacy Policy (“Policy”), the terms “GXI”, “we”, “us”, and “our” mean GXI Ltd. This Policy, in conjunction with our , explains how GXI may use the information we collect about you, as well as the rights you have over any personal information we hold about you. Please read this Policy and our  carefully; by accessing the Website you confirm to have understood and agreed to them. If you have questions or complaints regarding our privacy policy or practices, please contact us at  or write to us at GXI Ltd, Devonshire House, 582 Honeypot Lane, Stanmore, Harrow, London, HA7 1JS, UK.   We collect information about you (such as your name, email address, phone number, shipping address, order details, quote request) when you:   We collect your personal information to help GXI Ltd better understand you and enable us to personalise your experience with GXI, including offers, promotions, and services to meet your needs. We use your information to: We never share your information with third-party companies for their own use.   We ensure that your personal information is securely stored. We use SSL security on our Website that encrypts all the data submitted by you.   We do not share your personal information with any companies for their own use. However, we do share your data with our shipping partners and manufacturers to enable them to process and ship your orders.   We make use of cookies to personalise and enhance your shopping experience with us. More information about our cookie policy can be found here. Devonshire House 582 Honeypot Lane Stanmore, Harrow London, HA7 1JS London Office: GXI Group 2-7 Clerkenwell Green London EC1R 0DE Company number: 03274123 -   -   Registered company name: GXI LTD | Company reg. no: 03274123         × * * * * * visit the Website; take part in our promotions, competitions, customer surveys and questionnaires, or contact us via contact forms, email, phone, or letter. offers and promotions to you; process your orders; tell you about important changes to GXI; develop and improve our products and services; manage promotions, competitions, customer surveys and questionnaires; and check and verify your identity, and prevent or detect crime. to process and arrange the delivery of your orders. x This site uses cookies. Privacy Policy At GXI Limited, we make every effort to ensure we protect your personal information. This site, www.gxigroup.com (the “Website”) is owned and operated by GXI Ltd. In this Privacy Policy (“Policy”), the terms “GXI”, “we”, “us”, and “our” mean GXI Ltd. This Policy, in conjunction with our , explains how GXI may use the information we collect about you, as well as the rights you have over any personal information we hold about you. Please read this Policy and our  carefully; by accessing the Website you confirm to have understood and agreed to them. If you have questions or complaints regarding our privacy policy or practices, please contact us at  or write to us at GXI Ltd, Devonshire House, 582 Honeypot Lane, Stanmore, Harrow, London, HA7 1JS, UK. Information we collect We collect information about you (such as your name, email address, phone number, shipping address, order details, quote request) when you: visit the Website; take part in our promotions, competitions, customer surveys and questionnaires, or contact us via contact forms, email, phone, or letter. Why we collect your information We collect your personal information to help GXI Ltd better understand you and enable us to personalise your experience with GXI, including offers, promotions, and services to meet your needs. We use your information to: offers and promotions to you; process your orders; tell you about important changes to GXI; develop and improve our products and services; manage promotions, competitions, customer surveys and questionnaires; and check and verify your identity, and prevent or detect crime. to process and arrange the delivery of your orders. We never share your information with third-party companies for their own use. Security of your information We ensure that your personal information is securely stored. We use SSL security on our Website that encrypts all the data submitted by you. Third-party access to your information We do not share your personal information with any companies for their own use. However, we do share your data with our shipping partners and manufacturers to enable them to process and ship your orders. Usage of Cookies on the Website We make use of cookies to personalise and enhance your shopping experience with us. More information about our cookie policy can be found here. Our Work Company Our Services Contact Us - Registered company name: GXI LTD | Company reg. no: 03274123 × Request a call back from the GXI team First Name* Company* Last Name* Phone* Work Email* Preferred time Loading Your message has been sent. Thank you! Send Loading  Your message has been sent. Thank you!     Send"}, {"url": "https://www.gxigroup.com/terms-conditions/", "content": "Specialising in Fast-track End-to-end Office Fit Out and Refurbishments for Small & Medium Size Businesses 9. OUR DETAILS Devonshire House 582 Honeypot Lane Stanmore, Harrow London, HA7 1JS London Office: GXI Group 2-7 Clerkenwell Green London EC1R 0DE Company number: 03274123 -   -   Registered company name: GXI LTD | Company reg. no: 03274123         × * * * * * x This site uses cookies. Terms & Conditions GXI T&C’s These terms and conditions govern use of GXI Group website. Detail terms can be provided and request. Please read the terms in full before you use this Website. If you do not accept these terms, please do not use this Website. Using the Website implies that you accept these terms. We do occasionally update these terms so please refer back to them in the future. 1. SITE ACCESS You will be able to access the majority of this Website without having to register any details with us. However, certain areas of this Website will only be accessible only if you have registered with us. 2. USE OF WEBSITE You are NOT permitted to use our website for the purposes to print and download material from this Website without written consent from GXI Group. You cannot also modify any content without our consent. Material on this website must not be republished online or offline without our permission. The copyright and other intellectual property rights in all material on this Website are owned by us or our licensors and must not be reproduced without our prior consent. 3. SITE UPTIME We take all reasonable steps to ensure that this Website is available 24 hours every day, 365 days per year. However, websites do sometimes encounter downtime due to server and, other technical issues. Therefore we will not be liable if this website is unavailable at any time. This Website may be temporarily unavailable due to issues such as system failure, maintenance or repair or for reasons beyond our control. Where possible we will try to give our visitors advance warning of maintenance issues but shall not be obliged to do so. 4. VISITOR CONDUCT With the exception of personally identifiable information, the use of which is covered under our Privacy Policy any material you send or post to this Website shall be considered non-proprietary and not confidential. Unless you advise to the contrary we will be free to copy, disclose, distribute, incorporate and otherwise use such material for any and all purposes. When using this website you shall not post or send to or from this Website any material: (a) for which you have not obtained all necessary consents; (b) that is discriminatory, obscene, pornographic, defamatory, liable to incite racial hatred, in breach of confidentiality or privacy, which may cause annoyance or inconvenience to others, which encourages or constitutes conduct that would be deemed a criminal offence, give rise to a civil liability, or otherwise is contrary to the law in the United Kingdom; (c) which is harmful in nature including, and without limitation, computer viruses, Trojan horses, corrupted data, or other potentially harmful software or data. We will fully co-operate with any law enforcement authorities or court order requiring us to disclose the identity or other details of any person posting material to this website in breach of our terms 5. LINKS TO AND FROM OTHER WEBSITES Any links to third party websites located on this Website are provided for your convenience only. We have not reviewed each third party website and have no responsibility for such third party websites or their content. We do not endorse the third party websites or make representations about them or any material contained in them. If you choose to access a third party website linked to from this Website, it is at your own risk. If you would like to link to this Website, you may only do so on the basis that you link to, but do not replicate, any page on this Website, and subject to the following conditions: – you do not in any way imply that we are endorsing any services or products unless this has been specifically agreed with us; – you do not misrepresent your relationship with us or present any false information about us; – you do not link from a website that is not owned by you; and – your website does not contain content that is offensive, controversial, infringes any intellectual property rights or other rights of any other person or does not comply in any way with the law in the United Kingdom. If you choose to link to our website in breach of our terms you shall fully indemnify us for any loss or damage suffered as a result of your actions. 6. DISCLAIMER We take all reasonable steps to ensure that the information on this Website is correct. However, we do not guarantee the correctness or completeness of material on this Website. We may make changes to the material on this Website at any time and without notice. The material on this Website may be out of date, or on rare occasions incorrect and we make no commitment to ensure that such material is correct or up to date. The material at this Website is provided without any conditions or warranties of any kind. To the maximum extent permitted by law, we provide access and use of this website on the basis that we exclude all representations, warranties and conditions which but for these Terms may have effect in relation to this Website. All trademarks are property of their respective trademark owners. We acknowledge associated owners of images and contents. However, we take reasonable steps to acknowledge all imagery and content but due to the volume of images and content there are occasion when such acknowledgement may get missed, on such occasion we request owners to contact us so we can either make appropriate acknowledgements or remove from our web site. GXI cannot be held liable or responsible for such image or content being displayed or any kind of loss or damage that may result to you or a third party as a result of the use on our website. 7. EXCLUSION OF LIABILITY Neither we nor any other party (whether or not involved in producing, maintaining or delivering this Website), shall be liability or responsible for any kind of loss or damage that may result to you or a third party as a result of your or their use of our website. This exclusion shall include servicing or repair costs and, without limitation, any other direct, indirect or consequential loss, and whether in tort or contract or otherwise in connection with this Website. Nothing in these Terms shall exclude or limit liability for (i) death or personal injury caused by negligence (as defined by the Unfair Contract Terms Act 1977); (ii) fraud; (iii) misrepresentation as to a fundamental matter; or (iv) any liability which cannot be excluded or limited under the law of the United Kingdom. 8. GOVERNING JURISDICTION This Legal Notice shall be governed by and construed in accordance with English law. Any dispute(s) arising in connection with this Legal Notice are subject to the exclusive jurisdiction of England and Wales. GXI Ltd Devonshire House, 582 Honeypot Lane, Stanmore, Middlesex, HA7 1JS GXI Ltd reg No. 3274123. Tel: Email: GXI T&C’s These terms and conditions govern use of GXI Group website. Detail terms can be provided and request. Please read the terms in full before you use this Website. If you do not accept these terms, please do not use this Website. Using the Website implies that you accept these terms. We do occasionally update these terms so please refer back to them in the future. 1. SITE ACCESS You will be able to access the majority of this Website without having to register any details with us. However, certain areas of this Website will only be accessible only if you have registered with us. 2. USE OF WEBSITE You are NOT permitted to use our website for the purposes to print and download material from this Website without written consent from GXI Group. You cannot also modify any content without our consent. Material on this website must not be republished online or offline without our permission. The copyright and other intellectual property rights in all material on this Website are owned by us or our licensors and must not be reproduced without our prior consent. 3. SITE UPTIME We take all reasonable steps to ensure that this Website is available 24 hours every day, 365 days per year. However, websites do sometimes encounter downtime due to server and, other technical issues. Therefore we will not be liable if this website is unavailable at any time. This Website may be temporarily unavailable due to issues such as system failure, maintenance or repair or for reasons beyond our control. Where possible we will try to give our visitors advance warning of maintenance issues but shall not be obliged to do so. 4. VISITOR CONDUCT With the exception of personally identifiable information, the use of which is covered under our Privacy Policy any material you send or post to this Website shall be considered non-proprietary and not confidential. Unless you advise to the contrary we will be free to copy, disclose, distribute, incorporate and otherwise use such material for any and all purposes. When using this website you shall not post or send to or from this Website any material: (a) for which you have not obtained all necessary consents; (c) which is harmful in nature including, and without limitation, computer viruses, Trojan horses, corrupted data, or other potentially harmful software or data. We will fully co-operate with any law enforcement authorities or court order requiring us to disclose the identity or other details of any person posting material to this website in breach of our terms 5. LINKS TO AND FROM OTHER WEBSITES Any links to third party websites located on this Website are provided for your convenience only. We have not reviewed each third party website and have no responsibility for such third party websites or their content. We do not endorse the third party websites or make representations about them or any material contained in them. If you choose to access a third party website linked to from this Website, it is at your own risk. If you would like to link to this Website, you may only do so on the basis that you link to, but do not replicate, any page on this Website, and subject to the following conditions: – you do not in any way imply that we are endorsing any services or products unless this has been specifically agreed with us; – your website does not contain content that is offensive, controversial, infringes any intellectual property rights or other rights of any other person or does not comply in any way with the law in the United Kingdom. If you choose to link to our website in breach of our terms you shall fully indemnify us for any loss or damage suffered as a result of your actions. 6. DISCLAIMER We take all reasonable steps to ensure that the information on this Website is correct. However, we do not guarantee the correctness or completeness of material on this Website. We may make changes to the material on this Website at any time and without notice. The material on this Website may be out of date, or on rare occasions incorrect and we make no commitment to ensure that such material is correct or up to date. The material at this Website is provided without any conditions or warranties of any kind. To the maximum extent permitted by law, we provide access and use of this website on the basis that we exclude all representations, warranties and conditions which but for these Terms may have effect in relation to this Website. All trademarks are property of their respective trademark owners. We acknowledge associated owners of images and contents. However, we take reasonable steps to acknowledge all imagery and content but due to the volume of images and content there are occasion when such acknowledgement may get missed, on such occasion we request owners to contact us so we can either make appropriate acknowledgements or remove from our web site. GXI cannot be held liable or responsible for such image or content being displayed or any kind of loss or damage that may result to you or a third party as a result of the use on our website. 7. EXCLUSION OF LIABILITY Neither we nor any other party (whether or not involved in producing, maintaining or delivering this Website), shall be liability or responsible for any kind of loss or damage that may result to you or a third party as a result of your or their use of our website. This exclusion shall include servicing or repair costs and, without limitation, any other direct, indirect or consequential loss, and whether in tort or contract or otherwise in connection with this Website. Nothing in these Terms shall exclude or limit liability for (i) death or personal injury caused by negligence (as defined by the Unfair Contract Terms Act 1977); (ii) fraud; (iii) misrepresentation as to a fundamental matter; or (iv) any liability which cannot be excluded or limited under the law of the United Kingdom. 8. GOVERNING JURISDICTION This Legal Notice shall be governed by and construed in accordance with English law. Any dispute(s) arising in connection with this Legal Notice are subject to the exclusive jurisdiction of England and Wales. Devonshire House, 582 Honeypot Lane, Stanmore, Middlesex, HA7 1JS GXI Ltd reg No. 3274123. Email:  Our Work Company Our Services Contact Us - Registered company name: GXI LTD | Company reg. no: 03274123 × Request a call back from the GXI team First Name* Company* Last Name* Phone* Work Email* Preferred time Loading Your message has been sent. Thank you! Send Loading  Your message has been sent. Thank you!     Send"}, {"url": "https://www.gxigroup.com/sitemap/", "content": "Created with"}]