[
  {
    "page_url": "https://gxigroup.com",
    "summary": "GXI Group is a team of experts specializing in fast-track office fit out and refurbishments for small and medium-sized businesses. They offer end-to-end solutions, working with clients from securing office premises to building regulations, renovation, and furniture. They have completed numerous projects in various locations and industries, including banks, hotels, and educational institutions. Their strength lies in their interior designers and experienced team, who provide high-quality and affordable office spaces. The cost of office fit out depends on factors such as size, materials, and furniture. They provide estimated costs per square foot for both CAT A and CAT B fit outs."
  },
  {
    "page_url": "https://gxigroup.com/cdn-cgi/l/email-protection",
    "summary": "The website is protected by Cloudflare, which hides email addresses to prevent access by malicious bots. Enabling Javascript is necessary to decode the email address. Cloudflare offers similar protection for other websites."
  },
  {
    "page_url": "https://gxigroup.com/what-we-do/",
    "summary": "This summary is about a company specializing in fast-track office fit out and refurbishments for small and medium-sized businesses. They provide a fully integrated service, including planning, designing, building, furniture, and aftercare. They focus on creating office spaces that encourage efficient working and boost performance. They also offer ongoing maintenance and help businesses optimize their current space for future needs. The company is located in London and has experience in workplace refurbishment and installing partitions. They also provide office IT infrastructure, furniture, workplace consultancy, and wellbeing services."
  },
  {
    "page_url": "https://gxigroup.com/blog/essential-information-for-an-office-move",
    "summary": "This guide provides essential tips for planning an office move, including creating a detailed plan, selecting the right moving company, preparing the office space, managing the move, and settling into the new space. It emphasizes the importance of creating a timeline, budget, and inventory, as well as notifying employees and stakeholders. Choosing a reputable moving company, packing and labeling items, and arranging for service disconnections are also highlighted. The guide aims to help businesses ensure an efficient and stress-free office move."
  },
  {
    "page_url": "https://gxigroup.com/terms-conditions/",
    "summary": "The website belongs to GXI Group, a company specializing in fast-track office fit out and refurbishments for small and medium-sized businesses. The website provides information about the company, its services, and contact details. The terms and conditions of using the website are also outlined, including restrictions on the use of content and links to other websites. The company disclaims liability for any loss or damage resulting from the use of the website and states that the website is governed by English law."
  }
]